Repository: muhammadGagah/VisionAssistantPro
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fa, fr, id, it, pl, pt_pt, ru, tr, uk

source: Excitable
fa: هیجان‌انگیز
fr: Énergique
id: Antusias
it: Emozionante
pl: Entuzjastyczny
pt_pt: Excitável
ru: Воодушевлённый
tr: Heyecan verici
uk: Збудливий

source: Youthful
fa: سرزنده
fr: Jeune
id: Berjiwa Muda
it: Giovanile
pl: Młodzieńczy
pt_pt: Jovial
ru: Молодёжный
tr: Genç
uk: Молодіжний

source: Breezy
fa: فرح‌بخش
fr: Léger
id: Santai
it: Fresco
pl: Swobodny
pt_pt: Leve
ru: Лёгкий
tr: Esintili
uk: Прохолодний

source: Easy-going
fa: بی‌قید
fr: Détendu
id: Santai
it: Tranquillo
pl: Wyluzowany
pt_pt: Descontraída
ru: Непринуждённый
tr: Rahat
uk: Спокійний

source: Breathy
fa: نفس‌گیر
fr: Aérienne
id: Berdesah
it: Ansimante
pl: Szeptany
pt_pt: Sussurrada
ru: Дыхательный
tr: Nefes nefese
uk: Дихаючий

source: Clear
fa: زلال
fr: Claire
id: Jelas
it: Chiaro
pl: Wyraźny
pt_pt: Clara
ru: Чёткий
tr: Temizle
uk: Чіткий

source: Smooth
fa: ملایم
fr: Fluide
id: Mulus
it: Liscio
pl: Łagodny
pt_pt: Suave
ru: Плавный
tr: Pürüzsüz
uk: Плавний

source: Gravelly
fa: سنگریزه
fr: Graveleux
id: Serak
it: Ghiaioso
pl: Chropowaty
pt_pt: Rascante
ru: Хриплый
tr: Çakıllı
uk: Хрипкий

source: Soft
fa: نرم
fr: Douce
id: Lembut
it: Morbido
pl: Miękki
pt_pt: Suave
ru: Мягкий
tr: Yumuşak
uk: М'який

source: Even
fa: متعادل
fr: Équilibrée
id: Datar
it: Anche
pl: Równomierny
pt_pt: Uniforme
ru: Ровный
tr: Hatta
uk: Рівний

source: Mature
fa: بالغ
id: Dewasa
it: Maturo
pl: Dojrzały
pt_pt: Madura
ru: Зрелый
tr: Olgun
uk: Зрілий

source: Forward
fa: جسور
fr: Directe
id: Terus Terang
it: Inoltrare
pl: Bezpośredni
pt_pt: Confiante
ru: Прямой
tr: İleri
uk: Відкритий

source: Friendly
fa: دوستانه
fr: Amical
id: Ramah
it: Amichevole
pl: Przyjacielski
pt_pt: Amigável
ru: Дружелюбный
tr: Dostane
uk: Дружній

source: Casual
fa: غیرِ جدی
fr: Naturel
id: Kasual
it: Casuale
pl: Swobodny
ru: Повседневный
tr: Gündelik
uk: Повсякденний

source: Gentle
fa: نجیب
fr: Doux
id: Halus
it: Gentile
pl: Delikatny
pt_pt: Gentil
ru: Нежный
tr: Nazik
uk: Ніжний

source: Lively
fa: با‌نشاط
fr: Vive
id: Lincah
it: Vivace
pl: Żywiołowy
pt_pt: Animada
ru: Живой
tr: Canlı
uk: Жвавий

source: Knowledgeable
fa: دانا
fr: Experte
id: Berwawasan
it: Ben informato
pl: Kompetentny
pt_pt: Conhecedora
ru: Компетентный
tr: Bilgili
uk: Обізнаний

source: Warm
fa: گرم
fr: Chaleureux
id: Hangat
it: Caldo
pl: Ciepły
pt_pt: Acolhedora
ru: Тёплый
tr: Sıcak
uk: Теплий

source: Neutral
fr: Neutre
id: Netral

source: Quirky
fr: OriginalQuirky
id: Unik

source: Professional
fr: Professionnel
id: Profesional

source: Cheerful
fr: Joyeux
id: Periang

source: Confident
fr: Confiant
id: ConfidentKonfirmasi Reset

source: British
fr: Britanique
id: Aksen Inggris

source: Pleasant
fr: Agréable
id: Menyenangkan

source: Deep
fr: Profond
id: Berat

source: Expressive
fr: Expressif
id: Ekspresif

source: Reliable
fr: Rassurant
id: Dapat Diandalkan

source: Energetic
fr: Énergique
id: Energik

source: Chrome (Fast)
fa: کروم (سریع)
fr: Chrome (rapide)
id: Chrome (Cepat)
it: Chrome (veloce)
pl: Chrome (szybki)
pt_pt: Chrome (Rápido)
ru: Chrome (быстрый)
tr: Chrome (Hızlı)
uk: Швидкий

source: AI (Advanced)
fr: IA (avancé)
id: AI (Lanjutan)

source: Refine
fa: پالایش
fr: Assistant de texte
id: Penyempurnaan
it: Migliora
pl: Poprawianie
pt_pt: Refinar
ru: Улучшить текст
tr: İyileştir
uk: Уточнити

source: Summarize
fa: خلاصه کردن
fr: Résumer
id: Buat Ringkasan
it: Riassumi
pl: Podsumuj
pt_pt: Resumir
ru: Обобщить
tr: Özetle
uk: Підсумувати

source: Fix Grammar
fa: اصلاحِ گرامر
fr: Corriger la grammaire
id: Perbaiki Tata Bahasa
it: Correggi la grammatica
pl: Popraw gramatykę
pt_pt: Corrigir Gramática
ru: Исправить грамматику
tr: Dilbilgisini Düzelt
uk: Виправити граматику

source: Fix Grammar & Translate
fa: اصلاحِ گرامر و ترجمه
fr: Corriger la grammaire et traduire
id: Perbaiki Tata Bahasa & Terjemahkan
it: Correggi la &grammatica e traduci
pl: Popraw gramatykę i przetłumacz
pt_pt: Corrigir gramática e traduzir
ru: Исправить грамматику и перевести
tr: Dil Bilgisini Düzelt ve Çevir
uk: Виправити граматику та перекласти

source: Explain
fa: توضیح دادن
fr: Expliquer
id: Jelaskan
it: Spiega
pl: Wyjaśnij
pt_pt: Explicar
ru: Объяснить
tr: Açıklama
uk: Пояснити

source: Translation
fa: ترجمه
fr: Traduction
id: Terjemahan
it: Traduzione
pl: Tłumaczenie
pt_pt: Tradução
ru: Перевод
tr: Çeviri
uk: Переклад

source: Smart Translation
fa: ترجمه‌ی هوشمند
fr: Traduction intelligente
id: Terjemahan Cerdas
pl: inteligentne tłumaczenie
pt_pt: Tradução Inteligente
ru: Умный перевод
tr: Akıllı Çeviri
uk: Розумний переклад

source: Quick Translation
fa: ترجمه‌ی سریع
fr: Traduction rapide
id: Terjemahan Cepat
pl: szybkie Tłumaczenie
pt_pt: Tradução Rápida
ru: Быстрый перевод
tr: Hızlı Çeviri
uk: Швидкий переклад

source: Document
fa: سند
id: Dokumen
pl: Dokument
pt_pt: Documento
ru: Документ
tr: Belge
uk: Документ

source: Document Chat Context
fa: محتوای گفتگوی سند
fr: Contexte de discussion d'un document
id: Konteks Obrolan Dokumen
pl: Kontekst czatu z dokumentem
pt_pt: Contexto do Chat de Documentos
ru: Контекст чата с документом
tr: Belge Sohbet İçeriği
uk: Контекст чату документу

source: Vision
fa: بینایی
id: Penglihatan
pl: Rozpoznawanie
pt_pt: Visão
ru: Распознавание
tr: Görme
uk: Бачення

source: Navigator Object Analysis
fa: تحلیلِ پیمایشگر
fr: Analyse de l'objet navigateur
id: Analisis Objek Navigator
pl: Analiza obiektu nawigatora
pt_pt: Análise de objetos do navegador
ru: Анализ объекта навигатора
tr: Dolaşım Nesnesi Analizi
uk: Аналіз об'єкта навігатора

source: Full Screen Analysis
fa: تحلیلِ تمام‌صفحه
fr: Analyse de l'écran entier
id: Analisis Layar Penuh
pl: Analiza pełnego ekranu
pt_pt: Análise de Ecrã Completo
ru: Анализ всего экрана
tr: Tam Ekran Analizi
uk: Аналіз всього екрану

source: Video Analysis
fa: تحلیلِ ویدیو
fr: Analyse de vidéo
id: Analisis Video
pl: Analiza wideo
pt_pt: Análise de Vídeo
ru: Анализ видео
tr: Video Analizi
uk: Аналіз відео

source: Audio Transcription
fa: رونویسی از صوت
fr: Transcription audio
id: Transkripsi Audio
pl: Transkrypcja audio
pt_pt: Transcrição de Áudio
ru: Расшифровка аудио
tr: Ses Transkripsiyonu
uk: Аудіо транскрипція

source: Smart Dictation
fa: تایپِ صوتیِ هوشمند
fr: Dictée intelligente
id: Dikte Cerdas
pl: Inteligentne dyktowanie
pt_pt: Ditado Inteligente
ru: Умный голосовой ввод
tr: Akıllı Dikte
uk: Розумний диктант

source: OCR Image Extraction
fa: استخراجِ متن از تصویر (OCR)
fr: Extraction par OCR du texte d'une image
id: Ekstraksi Gambar OCR
pl: Wyodrębnianie tekstu z obrazu (OCR)
pt_pt: Extração de Imagem OCR
ru: Извлечение текста из изображения
tr: OCR Görüntü Çıkarma
uk: Розпізнавання зображень за допомогою OCR

source: OCR Document Extraction
fa: استخراجِ متن از سند (OCR)
fr: Extraction par OCR du texte d'un document
id: Ekstraksi Dokumen OCR
pl: Wyodrębnianie tekstu z dokumentu (OCR)
pt_pt: Extração de Documentos por OCR
ru: Извлечение текста из документа
tr: OCR Belge Çıkarma
uk: Розпізнавання документів за допомогою OCR

source: Document OCR + Translate
fa: اُسیآرِ سند + ترجمه
fr: Reconnaissance Optique de Caractères de document + Traduction
id: Dokumen OCR + Terjemahan
pl: OCR dokumentu + tłumaczenie
pt_pt: OCR de documentos mais tradução
ru: Распознавание документа и перевод
tr: Belge OCR + Çeviri
uk: OCR документа + переклад

source: CAPTCHA Solver
fa: حل‌کننده‌ی کپچا
fr: Résolution de CAPTCHA
id: Pemecah CAPTCHA
pl: Rozwiązywanie CAPTCHA
pt_pt: Resolução de CAPTCHA
ru: Решение CAPTCHA
tr: CAPTCHA Çözücü
uk: Розпізнавання CAPTCHA

source: Currently selected text
fa: متنِ در حالِ حاضر انتخاب‌شده
fr: Texte actuellement sélectionné
id: Teks yang dipilih saat ini
pl: Aktualnie zaznaczony tekst
pt_pt: Texto atualmente selecionado
ru: Текущий выделенный текст
tr: Şu anda seçili metin
uk: Поточний вибраний текст

source: Text
fa: متن
fr: Texte
id: Teks
pl: Tekst
pt_pt: Texto
ru: Текст
tr: Metin
uk: Текст

source: Clipboard content
fa: محتوای کلیپ‌برد
fr: Contenu du presse-papiers
id: Konten papan klip
pl: Zawartość schowka
pt_pt: Conteúdo da Área de Transferência
ru: Содержимое буфера обмена
tr: Pano içeriği
uk: Вміст буфера обміну

source: Screenshot of the navigator object
fa: اسکرین‌شاتِ پیمایشگر
fr: Capture d'écran de l'objet navigateur
id: Tangkapan layar objek navigator
pl: Zrzut ekranu obiektu nawigatora
pt_pt: Captura de ecrã do objeto do navegador
ru: Снимок объекта навигатора
tr: Dolaşım nesnesinin ekran görüntüsü
uk: Знімок об'єкта навігатора

source: Image
fa: تصویر
id: Gambar
pl: Obraz
pt_pt: Imagem
ru: Изображение
tr: Görsel
uk: Зображення

source: Screenshot of the entire screen
fa: اسکرین‌شات از تمامِ صفحه
fr: Capture de tout l'écran
id: Tangkapan layar seluruh layar
pl: Zrzut całego ekranu
pt_pt: Captura de ecrã de todo o ecrã
ru: Снимок всего экрана
tr: Tüm ekranın ekran görüntüsü
uk: Знімок всього екрану

source: Select image/PDF/TIFF for text extraction
fa: انتخابِ تصویر/PDF/TIFF برای استخراجِ متن
fr: Choisir une image/PDF/TIFF pour l'extraction de texte
id: Pilih gambar/PDF/TIFF untuk ekstraksi teks
pl: Wybierz obraz/PDF/TIFF do wyodrębnienia tekstu
pt_pt: Selecionar imagem/PDF/TIFF para extração de texto
ru: Выбрать изображение/PDF/TIFF для извлечения текста
tr: Metin çıkarma için resim/PDF/TIFF seçin
uk: Виберіть зображення/PDF/TIFF для вилучення тексту

source: Image, PDF, TIFF
fa: تصویر، PDF، TIFF
id: Gambar, PDF, TIFF
pl: Obraz, PDF, TIFF
pt_pt: Imagem, PDF, TIFF
ru: Изображение, PDF, TIFF
tr: Görsel, PDF, TIFF
uk: Зображення, PDF, TIFF

source: Select document for reading
fa: انتخابِ سند برای خواندن
fr: Choisir le document à lire
id: Pilih dokumen untuk dibaca
pl: Wybierz dokument do odczytu
pt_pt: Selecionar documento para leitura
ru: Выбрать документ для чтения
tr: Okumak için belge seçin
uk: Виберіть документ для читання

source: Select audio file for analysis
fa: انتخابِ فایلِ صوتی برای تجزیه و تحلیل
fr: Choisir le fichier audio à analyser
id: Pilih file audio untuk dianalisis
pl: Wybierz plik audio do analizy
pt_pt: Selecionar ficheiro de áudio para análise
ru: Выбрать аудиофайл для анализа
tr: Analiz için ses dosyasını seçin
uk: Виберіть аудіофайл для аналізу

source: Custom:
fa: سفارشی:
fr: Personnalisé :
id: Kustom:
pl: Niestandardowe:
pt_pt: Personalizado:
ru: Пользовательское:
tr: Özel:
uk: Користувацькі підказки:

source: {name} Error
fa: خطای {name}
fr: Erreur {name}
id: Kesalahan {name}
it: {name} Errore
pl: Błąd {name}
pt_pt: Erro em {name}
ru: Ошибка {name}
tr: {name} Hatası
uk: {name} Помилка

source: Error 400: Bad Request (Check API Key)
fa: خطای ۴۰۰: درخواستِ نامناسب. (کلیدِ API را بررسی کنید.)
fr: Erreur 400 : requête incorrecte (vérifier la clé API)
id: Kesalahan 400: Permintaan Tidak Valid (Periksa Kunci API)
it: Errore 400: Richiesta errata (Controlla la chiave API)
pl: Błąd 400: nieprawidłowe żądanie (sprawdź klucz API)
pt_pt: Erro 400: Pedido inválido (verifique a chave da API)
ru: Ошибка 400: Неверный запрос (проверьте ключ API)
tr: Hata 400: Hatalı İstek (API Anahtarını Kontrol Edin)
uk: Помилка 400: неправильний запит (перевірте ключ API)

source: Error 403: Forbidden (Check Region)
fa: خطای ۴۰۳: ممنوع (منطقه را بررسی کنید.)
fr: Erreur 403 : Interdit (vérifier la région)
id: Kesalahan 403: Akses Ditolak (Periksa Wilayah)
it: Errore 403: Forbidden (Controlla la regione)
pl: Błąd 403: dostęp zabroniony (sprawdź region)
pt_pt: Erro 403: Proibido (verifique a região)
ru: Ошибка 403: Доступ запрещён (проверьте регион)
tr: Hata 403: Yasak (Bölgeyi Kontrol Et)
uk: Помилка 403: заборонено (перевірте регіон)

source: Error 429: Quota Exceeded (Try later)
fa: خطای ۴۲۹: درخواست بیش از حدِ مجاز. (بعدا تلاش کنید.)
fr: Erreur 429 : Quota dépassé (Essayez plus tard)
id: Kesalahan 429: Kuota Melampaui Batas (Coba lagi nanti)
pl: Błąd 429: przekroczono limit (spróbuj później)
pt_pt: Erro 429: Cota Excedida (Tente mais tarde)
ru: Ошибка 429: Превышена квота (попробуйте позже)
tr: Hata 429: Kota Aşıldı (Daha sonra deneyin)
uk: Помилка 429: перевищено квоту (спробуйте пізніше)

source: Server Error {code}: {reason}
fa: خطای {code}ِ سِروِر: {reason}
fr: Erreur de serveur {code} : {reason}
id: Kesalahan Server {code}: {reason}
pl: Błąd serwera {code}: {reason}
pt_pt: Erro do Servidor {code}: {reason}
ru: Ошибка сервера {code}: {reason}
tr: Sunucu Hatası {code}: {reason}
uk: Помилка сервера {code}: {reason}

source: No API Keys configured.
fa: هیچ کلیدِ API پیکربندی نشده است.
fr: Aucune clé API configurée.
id: Tidak ada Kunci API yang dikonfigurasi.
it: Nessuna chiave API configurata.
pl: Nie skonfigurowano kluczy API.
pt_pt: Nenhuma chave de API configurada.
ru: Ключи API не настроены.
tr: API Anahtarı yapılandırılmadı.
uk: Ключі API не налаштовано.

source: All API Keys failed (Quota/Server).
fa: همه‌ی کلیدهای API با خطا مواجه شدند (سهمیه/سِروِر).
fr: Toutes les clés API ont échoué (Quota/Serveur).
id: Semua Kunci API gagal (Kuota/Server).
it: Tutte le chiavi API hanno fallito (quota/server)
pl: Wszystkie klucze API zawiodły (limit/serwer).
pt_pt: Todas as chaves de API falharam (cota/servidor).
ru: Все ключи API не сработали (квота/сервер).
tr: Tüm API Anahtarları başarısız (Kota/Sunucu).
uk: Усі ключі API не спрацювали (квота вичерпана/помилка сервера).

source: Unknown error occurred.
fa: خطای ناشناخته‌ای رخ داده است.
fr: Une erreur inconnue s'est produite.
id: Terjadi kesalahan yang tidak diketahui.
it: Si è verificato un errore sconosciuto.
pl: Wystąpił nieznany błąd.
pt_pt: Ocorreu um erro desconhecido.
ru: Произошла неизвестная ошибка.
tr: Bilinmeyen bir hata oluştu.
uk: Сталася невідома помилка.

source: No API Keys.
fa: هیچ کلیدِ API موجود نیست.
fr: Aucune clé API.
id: Tidak Ada Kunci API.
it: Nessuna chiave API.
pl: Brak kluczy API.
pt_pt: Nenhuma chave de API.
ru: Ключи API отсутствуют.
tr: API Anahtarı yok.
uk: Немає ключів API.

source: Upload failed.
fa: آپلود دچارِ خطا شد.
fr: Le téléversement a échoué.
id: Gagal mengunggah.
it: Caricamento fallito.
pl: Przesyłanie nie powiodło się.
pt_pt: Falha no envio.
ru: Не удалось загрузить.
tr: Yükleme başarısız.
uk: Помилка завантаження.

source: All keys failed.
fa: همه‌ی کلیدها دچارِ خطا شدند.
fr: Toutes les clés ont échoué.
id: Semua kunci gagal.
it: Tutte le chiavi API hanno fallito.
pl: Wszystkie klucze zawiodły.
pt_pt: Todas as chaves falharam.
ru: Все ключи не сработали.
tr: Tüm anahtarlar başarısız.
uk: Усі ключі не спрацювали.

source: Transcription Failed
fr: Échec de la transcription
id: Transkripsi Gagal

source: TTS is not supported by this provider.
fr: La synthèse vocale n'est pas prise en charge par ce fournisseur.
id: TTS tidak didukung oleh penyedia ini.

source: Update Available
fa: بروزرسانی موجود است
fr: Mise à jour disponible
id: Pembaruan Tersedia
it: Aggiornamento disponibile
pl: Dostępna jest aktualizacja
pt_pt: Actualização disponível
ru: Доступно обновление
tr: Güncelleme Mevcut
uk: Доступне оновлення

source: A new version ({version}) of {name} is available.
fa: یک نسخه‌ی جدید ({version}) از {name} موجود است.
fr: Une nouvelle version ({version}) de {name} est disponible.
id: Versi baru ({version}) of {name} telah tersedia.
it: È disponibile la versione ({version}) di {name}.
pl: Dostępna jest nowa wersja ({version}) dodatku {name}.
pt_pt: Uma nova versão ({version}) de {name} está disponível.
ru: Доступна новая версия ({version}) {name}.
tr: {name} için yeni bir sürüm ({version}) mevcut.
uk: Доступна нова версія ({version}) {name}.

source: Changes:
fa: تغییرات:
fr: Modifications :
id: Perubahan:
it: Cambiamenti:
pl: Zmiany:
pt_pt: Mudanças:
ru: Изменения:
tr: Değişiklikler:
uk: Зміни:

source: Download and Install?
fa: آیا دانلود و نصب می‌کنید؟
fr: Télécharger et installer ?
id: Unduh dan pasang?
it: Scarica ed installa?
pl: Pobrać i zainstalować?
pt_pt: Transferir e instalar?
ru: Загрузить и установить?
tr: İndirip Yüklensin mi?
uk: Завантажити та встановити?

source: &Yes
fa: &بله
fr: &Oui
id: &Ya
it: &Sì
pl: &Tak
pt_pt: &Sim
ru: &Да
tr: &Evet
uk: &Так

source: &No
fa: &نه
fr: &Non
id: &TIDAK
pl: &Nie
pt_pt: &Não
ru: &Нет
tr: &Hayır
uk: &Ні

source: Update found but no .nvda-addon file in release.
fa: بروزرسانی یافت شد ولی فایل .nvda-addon در Release موجود نیست.
fr: Mise à jour trouvée mais aucun fichier .nvda-addon dans la release.
id: Pembaruan ditemukan tetapi tidak ada berkas .nvda-addon dalam rilis.
it: Aggiornamento trovato ma nessun file .nvda-addon nel rilascio.
pl: Znaleziono aktualizację, ale brak pliku .nvda-addon w wydaniu.
pt_pt: Actualização encontrada, mas nenhum ficheiro .nvda-addon na versão disponibilizada.
ru: Обновление найдено, но в выпуске отсутствует файл .nvda-addon.
tr: Güncelleme bulundu ancak sürümde .nvda-eklenti dosyası yok.
uk: Оновлення знайдено, але у випуску немає файлу .nvda-addon.

source: You have the latest version.
fa: آخرین نسخه را دارید.
fr: Vous disposez de la dernière version.
id: Anda sudah menggunakan versi terbaru.
it: Hai l'ultima versione.
pl: Masz najnowszą wersję.
pt_pt: Já está a utilizar a versão mais recente.
ru: У вас установлена последняя версия.
tr: En son sürüme sahipsiniz.
uk: У вас остання версія.

source: Update check failed: {error}
fa: بررسیِ بروزرسانی دچارِ خطا شد: {error}
fr: Échec de vérification des mises à jour : {error}
id: Pemeriksaan pembaruan gagal: {error}
it: Controllo aggiornamento fallito: {error}
pl: Sprawdzanie aktualizacji nie powiodło się: {error}
pt_pt: Falha ao verificar a actualização: {error}
ru: Не удалось проверить обновления: {error}
tr: Güncelleme denetleme başarısız: {error}
uk: Не вдалося перевірити оновлення: {error}

source: Downloading update...
fa: در حالِ دانلودِ بروزرسانی...
fr: Téléchargement de la mise à jour...
id: Mengunduh pembaruan...
it: Download aggiornamento in corso...
pl: Pobieranie aktualizacji...
pt_pt: A transferir a actualização…
ru: Загрузка обновления...
tr: Güncelleme indiriliyor...
uk: Завантаження оновлення...

source: Download failed: {error}
fa: دانلود انجام نشد: {error}
fr: Échec du téléchargement : {error}
id: Pengunduhan gagal: {error}
it: Download fallito: {error}
pl: Pobieranie nie powiodło się: {error}
pt_pt: Falha na transferência: {error}
ru: Не удалось загрузить: {error}
tr: İndirme başarısız: {error}
uk: Помилка завантаження: {error}

source: AI Response:
fa: پاسخِ هوشِ مصنوعی:
fr: Réponse de l'IA :
id: Respon AI:
it: Risposta IA:
pl: Odpowiedź AI:
pt_pt: Resposta da IA:
ru: Ответ ИИ:
tr: Yapay Zeka Yanıtı:
uk: Відповідь ШІ:

source: Ask:
fa: بپرس:
fr: Demander :
id: Bertanya:
it: Chiedi:
pl: Zapytaj:
pt_pt: Perguntar:
ru: Запрос:
tr: Soru Sorun:
uk: Запитати:

source: Send
fa: ارسال
fr: Envoyer
id: Kirim
it: Invia
pl: Wyślij
pt_pt: Enviar
ru: Отправить
tr: Gönder
uk: Надіслати

source: View Formatted
fa: مشاهده‌ی پیام به صورتِ قالب‌بندی‌شده
id: Lihat tampilan terformat
it: Visualizza formattato
pl: Podgląd sformatowany
pt_pt: Ver formatado
ru: Просмотр с форматированием
tr: Biçimlendirilmiş olarak görüntüle
uk: Переглянути у форматованому вигляді

source: Save Content
fa: ذخیره کردنِ محتوا
fr: Enregistrer le contenu
id: Simpan isi obrolan
it: Salva contenuto
pl: Zapisz treść odpowiedzi
pt_pt: Guardar conteúdo
ru: Сохранить содержимое
tr: İçeriği Kaydet
uk: Зберегти вміст

source: Save Chat
fa: ذخیره کردنِ گفتگو
fr: Enregistrer la discussion
id: Simpan Obrolan
it: Salva chat
pl: Zapisz pełny czat
pt_pt: Guardar conversa
ru: Сохранить чат
tr: Sohbeti Kaydet
uk: Зберегти чат

source: You: {text}
fa: شما: {text}
fr: Vous : {text}
id: Kamu: {text}
it: Tu: {text}
pl: Ty: {text}
pt_pt: Você: {text}
ru: Вы: {text}
tr: Siz: {text}
uk: Ви: {text}

source: Thinking...
fa: در حالِ فکر کردن...
fr: Réflexion en cours...
id: Sedang berpikir...
it: Sto pensando...
pl: Przetwarzanie...
pt_pt: Pensando...
ru: Обработка...
tr: Düşünüyor...
uk: Думаю...

source: Formatted Conversation
fa: گفتگوی قالب‌بندی‌شده
fr: Conversation formatée
id: Percakapan Terformat
it: Conversazione formattata
pl: Sformatowana rozmowa
pt_pt: Conversa formatada
ru: Форматированный диалог
tr: Biçimlendirilmiş Konuşma
uk: Форматована розмова

source: Error displaying content: {error}
fa: خطا در نمایشِ محتوا: {error}
fr: Erreur à l'affichage du contenu : {error}
id: Kesalahan saat menampilkan isi obrolan: {error}
it: Errore nella visualizzazione del contenuto: {error}
pl: Błąd wyświetlania treści: {error}
pt_pt: Erro ao apresentar o conteúdo: {error}
ru: Ошибка при отображении содержимого: {error}
tr: İçerik görüntülenirken hata oluştu: {error}
uk: Помилка під час показу вмісту: {error}

source: Save Chat Log
fa: ذخیره کردنِ گزارشِ گفتگو
fr: Enregistrer la discussion
id: Simpan Log Obrolan
it: Salva il log della chat
pl: Zapisz dziennik czatu
pt_pt: Guardar registo da conversa
ru: Сохранить журнал чата
tr: Sohbet Günlüğünü Kaydet
uk: Зберегти журнал чату

source: Saved.
fa: ذخیره شد.
fr: Enregistré.
id: Disimpan.
it: Salvato.
pl: Zapisano.
pt_pt: Guardado.
ru: Сохранено.
tr: Kaydedildi.
uk: Збережено.

source: Save failed: {error}
fa: ذخیره نشد: {error}
fr: Échec de l'enregistrement : {error}
id: Gagal menyimpan: {error}
it: Salvataggio fallito: {error}
pl: Zapisywanie nie powiodło się: {error}
pt_pt: Falha ao guardar: {error}
ru: Не удалось сохранить: {error}
tr: Kaydedilemedi: {error}
uk: Не вдалося зберегти: {error}

source: Save Result
fa: ذخیره کردنِ نتیجه
fr: Enregistrer le résultat
id: Simpan Hasil
it: Salva risultato
pl: Zapisywanie wyniku
pt_pt: Guardar resultado
ru: Сохранить результат
tr: Sonucu Kaydet
uk: Зберегти результат

source: Connection
fa: اتصال
fr: Connexion
id: Koneksi
it: Connessione
pl: Połączenie
pt_pt: Ligação
ru: Подключение
tr: Bağlantı
uk: З'єднання

source: Custom
fr: Personnalisé
id: Kustom

source: Provider:
fr: Fournisseur :
id: Penyedia:

source: API Key (Separate multiple keys with comma or newline):
fr: Clé API (séparer plusieurs clés par une virgule ou un retour à la ligne) :
id: Kunci API (Pisahkan beberapa kunci dengan koma atau baris baru):

source: Show API Key
fa: نمایشِ کلیدِ API
fr: Afficher la clé API
id: Tampilkan Kunci API
it: Mostra chiave API
pl: Pokaż klucz API
pt_pt: Mostrar chave da API
ru: Показать ключ API
tr: API Anahtarını Göster
uk: Показати ключ API

source: Custom Provider Settings
fr: Paramètres du fournisseur personnalisé
id: Pengaturan Penyedia Kustom

source: API URL:
fr: URL de l'API :
id: URL API:

source: Model Name:
fr: Nom du modèle :
id: Nama Model:

source: API Type:
fr: Type d'API :
id: Jenis API:

source: OpenAI Compatible
fr: Compatible OpenAI
id: Kompatibel dengan OpenAI

source: Gemini Compatible
fr: Compatible Gemini
id: Kompatibel dengan Gemini

source: Supports File Upload
fr: Prend en charge le téléversement de fichiers
id: Mendukung Pengunggahan File

source: Advanced Endpoint Configuration
fr: Configuration avancée des points de terminaison
id: Konfigurasi Titik Akhir Lanjutan

source: Models List URL:
fr: URL de la liste des modèles :
id: URL Daftar Model:

source: OCR Endpoint URL:
fr: URL du point de terminaison OCR :
id: URL Titik Akhir OCR:

source: Custom OCR Model (Optional):
fr: Modèle OCR personnalisé (facultatif) :
id: Model OCR Kustom (Opsional):

source: Speech-to-Text (STT) URL:
fr: URL de conversion Parole vers Texte (transcription audio) :
id: URL Speech-to-Text (STT):

source: Custom STT Model (Optional):
fr: Modèle de transcription audio personnalisé (facultatif) :
id: Model STT Kustom (Opsional):

source: Text-to-Speech (TTS) URL:
fr: URL de conversion texte vers parole (synthèse vocale) :
id: URL Text-to-Speech (TTS):

source: Custom TTS Model (Optional):
fr: Modèle de synthèse vocale personnalisé (Facultatif) :
id: Model TTS Kustom (Opsional):

source: Custom TTS Voice Name (Optional):
fr: Nom de la voix de la synthèse vocale personnalisée (Facultatif) :
id: Nama Suara TTS Kustom (Opsional):

source: Fetch Models
fr: Récupérer les modèles
id: Ambil Model

source: AI Model:
fa: مدل هوشِ مصنوعی:
fr: Modèle d'IA :
id: Model AI:
it: Modello AI:
pl: Model AI:
pt_pt: Modelo de IA:
ru: Модель ИИ:
tr: Yapay Zeka Modeli:
uk: Модель ШІ:
