Repository: muhammadGagah/VisionAssistantPro
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fa, fr, id, it, pl, pt_pt, ru, tr, uk

source: Settings dialog is already open.
fa: پنجره‌ی تنظیمات از پیش باز است.
fr: La boîte de dialogue Paramètres est déjà ouverte.
id: Dialog pengaturan sudah terbuka.
it: La finestra delle impostazioni è già aperta.
pl: Okno ustawień jest już otwarte.
pt_pt: A caixa de diálogo de configurações já está aberta.
ru: Диалог настроек уже открыт.
tr: Ayarlar iletişim kutusu zaten açık.
uk: Діалог налаштувань уже відкрито.

source: Opening documentation...
fa: در حالِ باز کردنِ راهنما...
fr: Ouverture de la documentation...
id: Membuka dokumentasi...
it: Apro la documentazione...
pl: Otwieranie dokumentacji...
pt_pt: A abrir a documentação...
ru: Открытие документации...
tr: Belgeler açılıyor...
uk: Відкриття документації...

source: Documentation file not found.
fa: فایلِ راهنما یافت نشد.
fr: Fichier de documentation introuvable.
id: File dokumentasi tidak ditemukan.
it: File della documentazione non trovato.
pl: Nie znaleziono pliku dokumentacji.
pt_pt: Ficheiro de documentação não encontrado.
ru: Файл документации не найден.
tr: Yardım dosyası bulunamadı.
uk: Файл документації не знайдено.

source: An advanced AI assistant for NVDA using Gemini models. Command Layer: Press NVDA+Shift+V, then: - Smart Translator (T) / Clipboard (Shift+T) - Text Refiner (R) - Describe Object (V) / Full Screen (O) - Online Video Analysis (Shift+V) - Document Reader (D) - File OCR (F) - CAPTCHA Solver (C) - Audio Transcription (A) - Smart Dictation (S) - Announce Status (L) - Check Update (U) - Recall Last Result (Space), - Commands Help (H),
fa: یک دستیارِ پیشرفته‌ی هوشِ مصنوعی برای NVDA که از مدل‌های Gemini استفاده می‌کند. لایه‌ی فرمان‌ها: NVDA+Shift+V را بفشارید، سپس: - مترجمِ هوشمند (T)، ترجمه از کلیپ‌برد (Shift+T)؛ - پالایش‌کننده‌ی متن (R)؛ - توصیفِ پیمایشگر (V)، توصیف تمام صفحه (o)؛ - تحلیلِ آنلاینِ ویدئو (Shift+V)؛ - سندخوان (D)؛ - OCRِ فایل (F)؛ - حل‌کننده‌ی کپچا (C)؛ - رونویسیِ فایلِ صوتی (A)؛ - تایپِ صوتیِ هوشمند (S)؛ - اعلامِ وضعیت (L)؛ - بررسیِ بروزرسانی (U) - فراخوانیِ آخرین نتیجه (space) - راهنمای فرمان‌ها (H)
fr: Un assistant IA avancé pour NVDA utilisant les modèles Gemini. Commandes séquentielles : appuyez sur NVDA+Shift+V, puis :Fonctionnalités : - Traducteur intelligent (T) / Presse-papiers (Maj+T) - Analyseur de texte (R) - Décrire l'objet (V) / Tout l'écran (O) - Analyse de vidéos en ligne (Maj+V) - Lecteur de document (D) - Reconnaissance de texte d'un fichier (F) - Résolution de CAPTCHA (C) - Transcription audio (A) - Dictée intelligente (S) - Annonce du statut (L) - Vérification des mises à jour (U)
id: Asisten AI canggih untuk NVDA yang menggunakan model Gemini. Lapisan Perintah: Tekan NVDA+Shift+V, lalu: - Penerjemah Cerdas (T) / Terjemahkan yang ada di Papan Klip (Shift+T) - Penyempurna Teks (R) - Deskripsikan Objek (V) / Layar Penuh (O) - Analisis Video Secara Online (Shift+V) - Pembaca Dokumen (D) - OCR Berkas (F) - Pemecah CAPTCHA (C) - Transkripsi Audio (A) - Dikte Cerdas (S) - Umumkan Status (L) - Periksa Pembaruan (U) - Buka Hasil Terakhir (Space) - Bantuan Perintah (H)
pl: Zaawansowany asystent AI dla NVDA wykorzystujący modele Gemini. Warstwa poleceń: naciśnij NVDA+Shift+V, a następnie: - Inteligentny tłumacz (T) / Schowek (Shift+T) - Poprawianie tekstu (R) - Opis obiektu (V) / Cały ekran (O) - Analiza wideo online (Shift+V) - Czytnik dokumentów (D) - OCR pliku (F) - Rozwiązywanie CAPTCHA (C) - Transkrypcja audio (A) - Inteligentne dyktowanie (S) - Raportuj stan (L) - Sprawdź aktualizację (U) - pokaż ostatnią odpowiedź AI w trybie czatu. (Spacja) - Pomoc poleceń (H)
pt_pt: Um assistente de IA avançado para o NVDA que utiliza modelos Gemini. Camada de Comandos: Prima NVDA+Shift+V, depois: - Tradutor Inteligente (T) / Área de Transferência (Shift+T) - Aperfeiçoador de Texto (R) - Descrever Objeto (V) / Ecrã Completo (O) - Análise de Vídeo Online (Shift+V) - Leitor de Documentos (D) - OCR de Ficheiros (F) - Solucionador de CAPTCHA (C) - Transcrição de Áudio (A) - Ditado Inteligente (S) - Anunciar Estado (L) - Verificar Atualizações (U) - Recordar Último Resultado (Espaço) - Ajuda de Comandos (H)
tr: Gemini modellerini kullanan NVDA için gelişmiş bir yapay zeka asistanı. Komut Katmanı: NVDA+Shift+V tuşlarına basın, ardından: - Akıllı Çeviri (T) / Pano (Shift+T) - Metin İyileştirici (R) - Nesneyi Betimle (V) / Tam Ekran (O) - Çevrimiçi Video Analizi (Shift+V) - Belge Okuyucu (D) - Dosya OCR (F) - CAPTCHA Çözücü (C) - Sesi metne çevir (A) - Akıllı Dikte (S) - Durumu Seslendir (L) - Güncellemeleri Denetle (U) - Son Sonucu Geri Çağır (Boşluk), - Komut Yardımı (H),
uk: Розширений ШІ-асистент для NVDA, що використовує моделі Gemini. Командний шар: натисніть NVDA+Shift+V, а потім: - Розумний перекладач (T) / Буфер обміну (Shift+T) - Очищення тексту (R) - Опис об'єкта (V) / Повний екран (O) - Онлайн-аналіз відео (Shift+V) - Читач документів (D) - OCR файлів (F) - Розв'язування CAPTCHA (C) - Транскрипція аудіо (A) - Розумне диктування (S) - Оголошення статусу (L) - Показати останній результат (пробіл), - Перевірка оновлень (U) - Довідка команд (H),

source: ## Changes for 5.0 * **Multi-Provider Architecture**: Added full support for **OpenAI**, **Groq**, and **Mistral** alongside Google Gemini. Users can now choose their preferred AI backend. * **Advanced Model Routing**: Users of native providers (Gemini, OpenAI, etc.) can now select specific models from a dropdown list for different tasks (OCR, STT, TTS). * **Advanced Endpoint Configuration**: Custom provider users can manually input specific URLs and model names for granular control over local or third-party servers. * **Smart Feature Visibility**: The settings menu and Document Reader UI now automatically hide unsupported features (like TTS) based on the selected provider. * **Dynamic Model Fetching**: The addon now fetches the available model list directly from the provider's API, ensuring compatibility with new models as soon as they are released. * **Hybrid OCR & Translation**: Optimized the logic to use Google Translate for speed when using Chrome OCR, and AI-powered translation when using Gemini/Groq/OpenAI engines. * **Universal "Re-scan with AI"**: The Document Reader's re-scan feature is no longer limited to Gemini. It now utilizes whatever AI provider is currently active to re-process pages.
fr: ## Changements de la version 5.0 * **Architecture multi-fournisseurs** : Ajout de la prise en charge complète de **OpenAI**, **Groq** et **Mistral** aux côtés de Google Gemini. Les utilisateurs peuvent désormais choisir leur fournisseur d'IA préféré. * **Choix de modèle avancé** : Les utilisateurs de fournisseurs natifs (Gemini, OpenAI, etc.) peuvent désormais sélectionner des modèles spécifiques dans une liste déroulante pour différentes tâches (OCR, transcription vocale, synthese vocale). * **Configuration avancée des points de terminaison** : Les utilisateurs de fournisseurs personnalisés peuvent saisir manuellement des URL et des noms de modèles spécifiques pour un contrôle granulaire sur les serveurs locaux ou tiers. * **Visibilité des fonctionnalités intelligentes** : Le menu des paramètres et l'interface de lecture de document masquent désormais automatiquement les fonctionnalités non prises en charge (telles que TTS) en fonction du fournisseur sélectionné. * **Récupération de modèle dynamique** : L'extension récupère désormais la liste des modèles disponibles directement à partir de l'API du fournisseur, garantissant ainsi la compatibilité avec les nouveaux modèles dès leur sortie. * **OCR et traduction hybrides** : Optimisation de la logique pour utiliser Google Translate pour plus de rapidité lors de l'utilisation de Chrome OCR et de la traduction basée sur l'IA lors de l'utilisation des moteurs Gemini/Groq/OpenAI. * **"Re-scan universel avec l'IA"** : La fonction de nouvelle numérisation du Document Reader n'est plus limitée à Gemini. Il utilise désormais le fournisseur d’IA actuellement actif pour retraiter les pages.
id: ## Perubahan untuk 5.0 * **Arsitektur Multi-Penyedia**: Menambahkan dukungan penuh untuk **OpenAI**, **Groq**, dan **Mistral** bersama dengan Google Gemini. Pengguna kini dapat memilih backend AI yang mereka inginkan. * **Perutean Model Lanjutan**: Pengguna penyedia bawaan (Gemini, OpenAI, dll.) kini dapat memilih model tertentu dari daftar dropdown untuk berbagai tugas (OCR, STT, TTS). * **Konfigurasi Titik Akhir Lanjutan**: Pengguna penyedia kustom dapat secara manual memasukkan URL dan nama model tertentu untuk kontrol seutuhnya atas server lokal atau pihak ketiga. * **Visibilitas Fitur Cerdas**: Menu pengaturan dan UI Pembaca Dokumen kini secara otomatis menyembunyikan fitur yang tidak didukung (seperti TTS) berdasarkan penyedia yang dipilih. * **Pengambilan Model Dinamis**: Add-on ini kini mengambil daftar model yang tersedia langsung dari API penyedia, memastikan kompatibilitas dengan model baru segera setelah dirilis. * **Hybrid OCR & Translation**: Mengoptimalkan logika untuk menggunakan Google Translate untuk kecepatan saat menggunakan Chrome OCR, dan terjemahan bertenaga AI saat menggunakan mesin Gemini/Groq/OpenAI. * **Universal "Pindai ulang dengan AI"**: Fitur pemindaian ulang Pembaca Dokumen tidak lagi terbatas pada Gemini. Sekarang menggunakan penyedia AI apa pun yang aktif untuk memproses ulang halaman.

source: Edit
fa: ویرایش کردن
fr: Modifier
pl: Edytuj
pt_pt: Editar
ru: Редактировать
tr: Düzenle
uk: Редагувати

source: (Preview)
fa: (پیش‌نمایش)
fr: (Aperçu)
pl: (Podgląd)
pt_pt: (Pré-visualização)
ru: (Предварительная версия)
tr: (Önizleme)

source: Video
fa: ویدیو
fr: Vidéo
pl: Wideo
pt_pt: Vídeo
ru: Видео
uk: Відео

source: OCR
fa: نویسه‌خوانِ نوری
fr: Reconnaissance Optique de Caractères
ru: Распознавание текста (OCR)

source: AI: {text}
fa: هوشِ مصنوعی: {text}
fr: IA : {text}
it: IA: {text}
pt_pt: IA: {text}
ru: ИИ: {text}
tr: Yapay Zeka: {text}
uk: ШІ: {text}

source: AI:
fa: هومص:
fr: IA :
ru: ИИ:
tr: yapay zeka:
uk: ШІ:

source: [Pro]
fa: [حرفه‌ای]
pt_pt: [Prós]
ru: [Про]

source: Gemini (Formatted)
fa: جمینای (قالب‌بندی‌شده)
it: Gemini (formattato)
pl: Gemini (formatowany)
pt_pt: Gemini (Formatado)
ru: Gemini (форматированный)
tr: Gemini (Biçimlendirilmiş)
uk: Gemini (відформатований)

source: Advanced
fa: پیشرفته
pl: Zaawansowane
pt_pt: Avançado
ru: Дополнительно
tr: Gelişmiş
uk: Просунутий

source: Document Chat Bootstrap Reply
fa: پاسخِ راه‌اندازیِ گفتگوی سند
pl: Odpowiedź inicjująca czat z dokumentem
pt_pt: Resposta de Inicialização do Chat de Documentos
ru: Начальный ответ чата с документом
tr: Belge Sohbeti Önyükleme Yanıtı
uk: Відповідь у чаті документа (Bootstrap)"

source: Vision Follow-up Context
fa: محتوای پیگیریِ بینایی
pl: Kontekst pytań uzupełniających
pt_pt: Contexto de Seguimento do Visão
ru: Контекст продолжения распознавания
tr: Görme Takip Bağlamı
uk: Контекст подальшого бачення

source: Vision Follow-up Answer Rule
fa: قانونِ پاسخِ پیگیریِ بینایی
pl: Reguła odpowiedzi na pytania uzupełniające
pt_pt: Regra de Resposta de Seguimento do Visão
ru: Правило ответа при продолжении распознавания
tr: Görme Takibi Cevap Kuralı
uk: Правило відповіді для подальших дій щодо бачення

source: Audio
fa: صوت
pt_pt: Áudio
ru: Аудио
tr: Ses
uk: Аудіо

source: CAPTCHA
fa: کپچا

source: Refine Files-Only Fallback
fa: فقط اصلاحِ فایل‌ها مثلِ گذشته
pl: Poprawianie (tryb awaryjny, tylko pliki)
pt_pt: Aperfeiçoar Apenas Arquivos como Recurso Secundário
ru: Резервный вариант только для файлов
tr: Yalnızca Dosyaları İyileştirme Yedekleme
uk: Резервний режим лише для файлів

source: TXT, Code, PDF
fa: TXT، کد، PDF
pl: TXT, kod, PDF
ru: TXT, код, PDF
tr: TXT, Kod, PDF

source: Gemini API Key (Separate multiple keys with comma or newline):
fa: کلیدِ APIِ جمینای: (چند کلید را با کاما یا خطِ جدید از هم جدا کنید)
it: Chiave API Gemini (separa più chiavi con virgola o nuova linea):
pl: Klucz API Gemini (wiele kluczy oddziel przecinkiem lub nowym wierszem):
pt_pt: Chave da API Gemini (separe várias chaves com vírgula ou numa nova linha):
ru: Ключ API Gemini (разделяйте несколько ключей запятой или новой строкой):
tr: Gemini API Anahtarı (Birden fazla anahtarı virgül veya yeni satıra geçerek ayırın):
uk: Ключ Gemini API (розділіть кілька ключів комами або новим рядком):

source: Uploading to Gemini...
fa: در حالِ آپلود به جمینای...
it: Caricamento su Gemini...
pl: Przesyłanie do Gemini...
pt_pt: A enviar para o Gemini…
ru: Загрузка в Gemini...
tr: Gemini'ye yükleniyor...
uk: Відвантаження до Gemini...

source: Re-scan with Gemini (Alt+R)
fa: با جمینای دوباره اسکن کن (Alt+R)
it: Ri-scansiona con Gemini (Alt+R)
pl: przeskanuj ponownie przez Gemini (Alt+R)
pt_pt: Reescanear com o Gemini (Alt+R)
ru: Пересканировать с Gemini (Alt+R)
tr: Gemini ile yeniden tara (Alt+R)
uk: Повторне сканування за допомогою Gemini (Alt+R)

source: [OCR failed. Try Gemini Re-scan.]
fa: [OCR دچارِ خطا شد. اسکنِ دوباره با جمینای را امتحان کن.]
pl: [OCR nie powiodło się. Spróbuj ponownego skanowania przez Gemini.]
pt_pt: [OCR falhou. Experimente a nova digitalização do Gemini.]
ru: [OCR не удался. Попробуйте пересканировать с Gemini.]
tr: [OCR başarısız. Gemini ile Yeniden Tara.]
uk: [Помилка OCR. Спробуйте повторне сканування Gemini.]

source: Scanning with Gemini...
fa: در حالِ اسکن کردن با جمینای...
it: Scansione con Gemini...
pl: Skanowanie przez Gemini...
pt_pt: A digitalizar com o Gemini…
ru: Сканирование с Gemini...
tr: Gemini ile taranıyor...
uk: Сканування за допомогою Gemini...

source: Unknown error
fa: خطای ناشناخته
it: Errore sconosciuto
pl: Nieznany błąd
pt_pt: Erro desconhecido
ru: Неизвестная ошибка
tr: Bilinmeyen hata
uk: Невідома помилка

source: Scan failed: {err}
fa: اسکن نشد: {err}
it: Scansione fallita: {err}
pl: Skanowanie nie powiodło się: {err}
pt_pt: Falha na digitalização: {err}
ru: Сканирование не удалось: {err}
tr: Tarama başarısız: {err}
uk: Помилка сканування: {err}

source: Vision Assistant
fa: دستیارِ بینایی
pt_pt: Assistente de Visão
tr: Görsel Asistan

source: Upload Connection Error: {reason}
fa: خطای اتصال هنگامِ آپلود: {reason}
it: Errore di connessione durante il caricamento: {reason}
pl: Błąd połączenia podczas przesyłania: {reason}
pt_pt: Erro de Conexão no Upload: {reason}
ru: Ошибка подключения при загрузке: {reason}
tr: Yükleme Bağlantı Hatası: {reason}
uk: Помилка з’єднання під час відвантаження: {reason}

source: Upload Server Error {code}: {reason}
fa: خطای {code}ِ سِروِرِ آپلود: {reason}
it: Errore del server di caricamento {code}: {reason}
pl: Błąd serwera podczas przesyłania {code}: {reason}
pt_pt: Erro do Servidor no Upload {code}: {reason}
ru: Ошибка сервера {code} при загрузке: {reason}
tr: Yükleme Sunucu Hatası {code}: {reason}
uk: Помилка сервера відвантаження {code}: {reason}

source: Uploading & Extracting...
fa: در حالِ آپلود و استخراج...
it: Caricamento ed &estrazione...
pl: Przesyłanie i wyodrębnianie...
pt_pt: A enviar e a extrair…
ru: Загрузка и извлечение...
tr: Yükleniyor ve ayıklanıyor...
uk: Відвантаження & видобування...

source: No text detected in the selected file(s).
fa: هیچ متنی در فایل(های) انتخاب‌شده شناسایی نشد.
pl: Nie wykryto tekstu w wybranych plikach.
pt_pt: Nenhum texto detectado no(s) ficheiro(s) selecionado(s).
ru: Текст не обнаружен в выбранном файле (файлах).
tr: Seçilen dosyalarda metin algılanmadı.
uk: У вибраних файлах не виявлено тексту.

source: Error processing audio.
fa: خطا هنگامِ پردازشِ صوت.
it: Errore nell'elaborazione audio.
pl: Błąd przetwarzania audio.
pt_pt: Erro ao processar áudio.
ru: Ошибка обработки аудио.
tr: Ses işlenirken hata oluştu.
uk: Помилка обробки аудіо.

source: Failed.
fa: ناموفق بود.
it: Fallito.
pl: Niepowodzenie.
pt_pt: Falhou.
ru: Не удалось.
tr: Başarısız.
uk: Не вдалося.

source: Captcha: {text}
fa: کپچا: {text}

source: Vision Assistant Pro
fa: دستیارِ حرفه‌ایِ بینایی
pt_pt: Assistente de Visão Pro
ru: Vision Assistant (Визуальный помощник)
tr: Profesyonel Görsel Asistan

source: ## Changes for 4.6 * **Interactive Result Recall:** Added the **Space** key to the command layer, allowing users to instantly reopen the last AI response in a chat window for follow-up questions, even when "Direct Output" mode is active. * **Telegram Community Hub:** Added an "Official Telegram Channel" link to the NVDA Tools menu, providing a quick way to stay updated with the latest news, features, and releases. * **Enhanced Response Stability:** Optimized the core logic for Translation, OCR, and Vision features to ensure more reliable performance and a smoother experience when using direct speech output. * **Improved Interface Guidance:** Updated the settings descriptions and documentation to better explain the new recall system and how it works alongside the direct output settings.
fa: ## تغییراتِ نسخه‌ی ۴.۶ * **فراخوانیِ تعاملیِ نتیجه:** کلید **Space** به لایه‌ی فرمان‌ها افزوده شد که به کاربران اجازه می‌دهد فوراً آخرین پاسخِ هوشِ مصنوعی را در پنجره‌ی گفتگو برای سؤالاتِ بعدی باز کنند، حتی زمانی که حالتِ «خروجیِ مستقیم» فعال است. * **مرکزِ انجمنِ تلگرام:** لینکِ «کانالِ رسمیِ افزونه در تلگرام» به منوی ابزارهای NVDA افزوده شد که راهی سریع برای به‌روز ماندن با آخرین اخبار، ویژگی‌ها و نسخه‌ها ارائه می‌کند. * **پایداریِ پیشرفته در پاسخگویی:** منطقِ اصلی برای ویژگی‌های ترجمه، OCR و بینایی بهینه شد تا از عملکردِ قابلِ اعتمادتر و تجربه‌ی روان‌تر هنگامِ استفاده از خروجیِ گفتارِ مستقیم اطمینان حاصل شود. * **راهنمای رابطِ کاربریِ بهبودیافته:** شرحِ تنظیمات و راهنما برای توضیحِ بهترِ سیستمِ جدیدِ فراخوان و نحوه‌ی عملکردِ آن در کنارِ تنظیماتِ خروجیِ مستقیم به روز شد.
pl: ## Zmiany w wersji 4.6 * **Możliwość wymuszenia trybu interaktywnego czatu:** Dodano klawisz **Spacja** do warstwy poleceń, umożliwiający otwarcie ostatniej odpowiedzi AI w oknie czatu w celu zadawania dodatkowych pytań, nawet gdy aktywny jest tryb bezpośredni. * **Hub społeczności w Telegramie:** Dodano link do "Oficjalnego kanału w Telegramie" w menu Narzędzia NVDA, zapewniający szybki dostęp do najnowszych wiadomości o tym dodatku. * **Zwiększona stabilność odpowiedzi:** Zoptymalizowano główną logikę funkcji tłumaczenia, OCR i przetwarzania obrazu, aby zapewnić bardziej niezawodne działanie i płynniejsze korzystanie z bezpośredniego wyjścia mowy. * **Ulepszone wskazówki interfejsu:** Zaktualizowano opisy ustawień i dokumentację.
pt_pt: ## Alterações para a versão 4.6 * **Recordação Interativa de Resultados:** Adicionada a tecla **Espaço** à camada de comandos, permitindo aos utilizadores reabrir instantaneamente a última resposta da IA numa janela de chat para questões de acompanhamento, mesmo quando o modo "Saída Direta" está ativo. * **Hub da Comunidade Telegram:** Adicionado um link para o "Canal Oficial do Telegram" no menu Ferramentas do NVDA, proporcionando uma forma rápida de se manter atualizado com as últimas novidades, funcionalidades e lançamentos. * **Maior Estabilidade das Respostas:** Otimizada a lógica principal das funcionalidades de Tradução, OCR e Visão, garantindo um desempenho mais fiável e uma experiência mais fluida ao utilizar a saída de voz direta. * **Melhoria na Orientação da Interface:** Atualizadas as descrições das definições e a documentação para explicar melhor o novo sistema de recordação e o seu funcionamento em conjunto com as definições de saída direta.
tr: ## 4.6 için değişiklikler * **Etkileşimli Sonuç Geri Çağırma:** Komut katmanına **Boşluk** tuşu eklendi; bu sayede, "Doğrudan Çıktı" modu etkin olsa bile, kullanıcıların takip soruları için bir sohbet penceresindeki son YZ yanıtını anında yeniden açmasına olanak tanındı. * **Telegram Topluluk Merkezi:** NVDA Araçlar menüsüne, en son haberler, özellikler ve sürümlerle güncel kalmanın hızlı bir yolunu sağlayan bir "Resmi Telegram Kanalı" bağlantısı eklendi. * **Gelişmiş Yanıt Kararlılığı:** Doğrudan konuşma çıkışını kullanırken daha güvenilir performans ve daha sorunsuz bir deneyim sağlamak için Çeviri, OCR ve Görüntü özellikleri için temel mantık optimize edildi. * **Geliştirilmiş Arayüz Kılavuzu:** Yeni geri çağırma sistemini ve doğrudan çıkış ayarlarıyla birlikte nasıl çalıştığını daha iyi açıklamak için ayar açıklamaları ve belgeleri güncellendi.
uk: ## Зміни для 4.6 * **Інтерактивне відновлення результатів:** до шару команд додано клавішу **Пробіл**, що дозволяє користувачам миттєво відкривати останню відповідь ШІ у діалозі чату для подальших запитань, навіть якщо активний режим «Прямий вивід». * **Центр спільноти Telegram:** додано посилання «Офіційний канал Telegram» у меню інструментів NVDA, що забезпечує швидкий спосіб бути в курсі останніх новин, функцій і випусків. * **Покращена стабільність відгуку:** оптимізовано основну логіку для функцій перекладу, оптичного розпізнавання тексту та візуалізації, щоб забезпечити більш надійну роботу та більш плавну роботу під час використання прямого мовлення. * **Покращений інтерфейс: ** оновлено опис налаштувань і документацію, щоб краще пояснити нову систему показу та її роботу разом із налаштуваннями прямого виводу.

source: An advanced AI assistant for NVDA using Gemini models. Command Layer: Press NVDA+Shift+V, then: - Smart Translator (T) / Clipboard (Shift+T) - Text Refiner (R) - Describe Object (V) / Full Screen (O) - Online Video Analysis (Shift+V) - Document Reader (D) - File OCR (F) - CAPTCHA Solver (C) - Audio Transcription (A) - Smart Dictation (S) - Announce Status (L) - Check Update (U)
it: Un assistente AI avanzato per NVDA che utilizza modelli Gemini. Layer Comandi: Premi NVDA+Shift+V, poi: - Traduttore intelligente (T) / Blocco appunti (Shift+T) - Miglioramento testo (R) - Descrivi l'oggetto (V) / Schermo intero (O) - Analisi video online (Shift+V) - Lettore Documenti (D) - File OCR (F) - Risolutore CAPTCHA (C) - Trascrizione audio (A) - Dettatura intelligente (S) - Annuncia lo stato (L) - Controllo aggiornamenti (U)
ru: Дополнение VisionAssistant - это продвинутый ИИ-помощник для NVDA, использующий модели Gemini. Командный слой: нажмите NVDA+Shift+V, затем: Умный переводчик (T) / Перевод из буфера обмена (Shift+T). Улучшение текста (R). Описать объект (V) / Весь экран (O). Анализ онлайн-видео (Shift+V). Средство чтения документов (D). Распознавание текста из файла (F). Решение CAPTCHA (C). Расшифровка аудио (A). Умный голосовой ввод (S). Отчёт о состоянии (L). Проверка обновлений (U).
