Repository: muhammadGagah/VisionAssistantPro
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fa, fr, id, it, pl, pt_pt, ru, tr, uk

source: ## Changes for 4.5 **Advanced Prompt Manager:** Introduced a dedicated management dialog in settings to customize default system prompts and manage user-defined prompts with full support for adding, editing, reordering, and previewing. **Comprehensive Proxy Support:** Resolved network connectivity issues by ensuring that user-configured proxy settings are strictly applied to all API requests, including translation, OCR, and speech generation. **Automated Data Migration:** Integrated a smart migration system to automatically upgrade legacy prompt configurations to a robust v2 JSON format upon the first run without data loss. **Updated Compatibility (2025.1):** Set the minimum required NVDA version to 2025.1 due to library dependencies in advanced features like the Document Reader to ensure stable performance. **Optimized Settings Interface:** Streamlined the settings interface by reorganizing prompt management into a separate dialog, providing a cleaner and more accessible user experience. **Prompt Variables Guide:** Added a built-in guide within the prompt dialogs to help users easily identify and use dynamic variables such as [selection], [clipboard], and [screen_obj].
ru: ## Изменения в версии 4.5 **Продвинутый менеджер запросов:** Представлен специальный диалог управления в настройках для кастомизации системных запросов по умолчанию и управления пользовательскими запросами с полной поддержкой добавления, редактирования, изменения порядка и предварительного просмотра. **Всесторонняя поддержка прокси:** Устранены проблемы с сетевым подключением за счёт строгого применения настроек прокси, заданных пользователем, ко всем запросам API, включая перевод, OCR и генерацию речи. **Автоматическая миграция данных:** Интегрирована интеллектуальная система миграции для автоматического обновления устаревших конфигураций запросов до надёжного формата JSON v2 при первом запуске без потери данных. **Обновлена совместимость (2025.1):** Минимально требуемая версия NVDA установлена на 2025.1 из-за зависимостей библиотек в продвинутых функциях, таких как «Средство чтения документов», для обеспечения стабильной работы. **Оптимизированный интерфейс настроек:** Упрощён интерфейс настроек путём реорганизации управления запросами в отдельный диалог, обеспечивая более чистый и доступный пользовательский опыт. **Руководство по переменным запросов:** Добавлено встроенное руководство в диалогах запросов, чтобы помочь пользователям легко идентифицировать и использовать динамические переменные, такие как [selection], [clipboard] и [screen_obj].

source: Address copied to clipboard! If you'd like, you can now proceed to your wallet and donate any amount you can. Your support is greatly appreciated!
it: Indirizzo copiato negli appunti! Se lo desideri, ora puoi procedere al tuo portafoglio e donare qualsiasi importo possibile. Il tuo supporto è molto apprezzato!

source: {name} is a project born from a personal vision to bridge the gap between AI and true accessibility. The initial concept and many of the features you enjoy were created from my own ideas to solve real challenges and provide a new level of digital independence. I take great pride in thinking through every detail and turning both my own innovations and your valuable requests into reality. Ensuring this tool remains fast, stable, and constantly evolving is a continuous creative journey that I am passionate about pursuing. If this assistant has brought value to your daily life, your support is a wonderful way to show appreciation for the original work and the dedication behind it. It provides the extra motivation to keep the inspiration alive and ensures we can continue to push the boundaries together. Thank you for being part of this mission!
it: {name} è un progetto nato da una visione personale per colmare il divario tra AI e vera accessibilità. Il concetto iniziale e molte delle funzionalità che ti piacciono sono stati creati dalle mie idee per risolvere sfide reali e fornire un nuovo livello di indipendenza digitale. Sono molto orgoglioso di pensare ad ogni dettaglio e di trasformare in realtà sia le mie innovazioni che le vostre preziose richieste. Garantire che questo strumento rimanga veloce, stabile e in continua evoluzione è un viaggio creativo continuo che voglio continuare a perseguire. Se questo assistente ha apportato valore alla tua vita quotidiana, il tuo supporto è un modo meraviglioso per mostrare apprezzamento per il lavoro originale e la dedizione che c'è dietro. Fornisce la motivazione extra per mantenere viva l’ispirazione e garantisce che possiamo continuare a superare i limiti insieme. Grazie per aver preso parte a questa missione!

source: Format: Name:Content
it: Formato: Name:Content

source: ## Changes for 4.0.1 * **Advanced Document Reader:** A powerful new viewer for PDF and images with page range selection, background processing, and seamless `Ctrl+PageUp/Down` navigation. * **New Tools Submenu:** Added a dedicated "Vision Assistant" submenu under NVDA's Tools menu for quicker access to core features, settings, and documentation. * **Flexible Customization:** You can now choose your preferred OCR engine and TTS voice directly from the settings panel. * **Multiple API Key Support:** Added support for multiple Gemini API keys. You can enter one key per line or separate them with commas in the settings. * **Alternative OCR Engine:** Introduced a new OCR engine to ensure reliable text recognition even when hitting Gemini API quota limits. * **Smart API Key Rotation:** Automatically switches to and remembers the fastest working API key to bypass quota limits. * **Document to MP3/WAV:** Integrated capability to generate and save high-quality audio files in both MP3 (128kbps) and WAV formats directly within the reader. * **Instagram Stories Support:** Added the ability to describe and analyze Instagram Stories using their URLs. * **TikTok Support:** Introduced support for TikTok videos, allowing for full visual description and audio transcription of clips. * **Redesigned Update Dialog:** Features a new accessible interface with a scrollable text box to clearly read version changes before installing. * **Unified Status & UX:** Standardized file dialogs across the add-on and enhanced the 'L' command to report real-time progress.
it: ## Cambiamenti nella versione 4.0.1 * **Lettore di documenti avanzato:** Un nuovo potente visualizzatore per PDF e immagini con selezione di intervalli di pagine, elaborazione in background e navigazione con Ctrl+PaginaSu/Giù senza soluzione di continuità.\n * **Nuovo sottomenu Strumenti:** Aggiunto un sottomenu dedicato "Vision Assistant" nel menu Strumenti di NVDA per un accesso più rapido alle funzionalità principali, alle impostazioni e alla documentazione.\n * **Personalizzazione flessibile:** ora puoi scegliere il motore OCR e la voce TTS preferiti direttamente dal pannello delle impostazioni.\n * **Supporto per chiavi API multiple:** Aggiunto supporto per più chiavi API Gemini. Puoi inserire una chiave per riga o separarle con virgole nelle impostazioni.\n * **Motore OCR alternativo:** Introdotto un nuovo motore OCR per garantire un riconoscimento affidabile del testo anche quando si raggiungono i limiti di quota dell'API Gemini.\n * **Rotazione intelligente della chiave API:** Passa automaticamente e ricorda la chiave API più veloce per aggirare i limiti di quota.\n * **Documento in MP3/WAV:** Funzionalità integrata per generare e salvare file audio di alta qualità sia nei formati MP3 (128 kbps) che WAV direttamente nel lettore.\n * **Supporto per le storie di Instagram:** aggiunta la possibilità di descrivere e analizzare le storie di Instagram utilizzando i relativi URL.\n * **Supporto TikTok:** introdotto il supporto per i video TikTok, che consente la descrizione visiva completa e la trascrizione audio dei clip.\n * **Finestra di dialogo di aggiornamento riprogettata:** Presenta una nuova interfaccia accessibile con una casella di testo scorrevole per leggere chiaramente le modifiche alla versione prima dell'installazione.\n * **Unified Status e UX:** Finestre di dialogo dei file standardizzate nel componente aggiuntivo e migliorato il comando 'L' per segnalare i progressi in tempo reale.
