Repository: muhammadGagah/VisionAssistantPro
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fa, fr, id, it, pl, pt_pt, ru, tr, uk

source: Translates the selected text or navigator object.
fa: متنِ انتخاب‌شده یا پیمایشگر را ترجمه می‌کند.
fr: Traduit le texte sélectionné ou l'objet navigateur.
id: Menerjemahkan teks atau objek navigator yang dipilih.
it: Traduce il testo selezionato o l'oggetto del navigatore.
pl: Tłumaczy zaznaczony tekst lub obiekt nawigatora.
pt_pt: Traduz o texto selecionado ou objeto do navegador.
ru: Переводит выделенный текст или объект навигатора.
tr: Seçili metni veya dolaşım nesnesini çevirir.
uk: Перекладає вибраний текст або об'єкт навігатора.

source: Translates the text currently in the clipboard.
fa: متنِ در حالِ حاضر موجود در کلیپ‌برد را ترجمه می‌کند.
fr: Traduit le texte du presse-papiers.
id: Menerjemahkan teks yang saat ini ada di papan klip.
it: Traduce il testo presente negli appunti.
pl: Tłumaczy tekst znajdujący się w schowku.
pt_pt: Traduz o texto atualmente na área de transferência.
ru: Переводит текст, находящийся в буфере обмена.
tr: Panoda bulunan metni çevirir.
uk: Перекладає текст, який зараз знаходиться в буфері обміну.

source: Opens a menu to Explain, Summarize, or Fix the selected text.
fa: منویی را برای توضیح دادن، خلاصه کردن یا اصلاحِ متن انتخاب‌شده باز می‌کند.
fr: Ouvre un menu pour expliquer, résumer ou corriger le texte sélectionné.
id: Membuka menu untuk Menjelaskan, Meringkas, atau Memperbaiki teks yang dipilih.
it: Apre un menu per spiegare, riassumere o correggere il testo selezionato.
pl: Otwiera menu do wyjaśniania, podsumowywania lub poprawiania zaznaczonego tekstu.
pt_pt: Abre um menu para Explicar, Resumir ou Corrigir o texto selecionado.
ru: Открывает меню для объяснения, обобщения или исправления выделенного текста.
tr: Seçilen metni Açıklamak, Özetlemek veya Düzeltmek için bir menü açar.
uk: Відкриває меню для пояснення, підсумовування або виправлення вибраного тексту.

source: Performs OCR and description on the entire screen.
fa: عملیاتِ OCR و توضیحات را بر روی تمامِ صفحه انجام می‌دهد.
fr: Effectue l'OCR et la description de tout l'écran.
id: Melakukan OCR dan deskripsi di seluruh layar.
it: Esegue OCR e descrizione su tutto lo schermo.
pl: Wykonuje OCR i opis całego ekranu.
pt_pt: Realiza OCR e descreve o ecrã inteiro.
ru: Выполняет распознавание текста (OCR) и описание всего экрана.
tr: Tüm ekranda OCR ve betimleme gerçekleştirir.
uk: Виконує оптичне розпізнавання та опис для всього екрана.

source: Describes the current object (Navigator Object).
fa: پیمایشگرِ جاری را توضیح می‌دهد.
fr: Décrit l'objet courant (objet navigateurr).
id: Menjelaskan objek saat ini (Navigator Object).
it: Descrive l'oggetto corrente (Oggetto del Navigatore).
pl: Opisuje bieżący obiekt (obiekt nawigatora).
pt_pt: Descreve o objeto atual (Objeto do Navegador).
ru: Описывает текущий объект (объект навигатора).
tr: Geçerli nesneyi (Dolaşım Nesnesi) betimler.
uk: Описує поточний об'єкт (об'єкт навігатора).

source: Opens the Document Reader for detailed page-by-page analysis (PDF/Images).
fa: سندخوان را برای تجزیه و تحلیلِ دقیقِ صفحه به صفحه (PDF/تصاویر) باز می کند.
fr: Ouvre le lecteur de documents pour une analyse détaillée page par page (PDF/Images).
id: Membuka Pembaca Dokumen untuk analisis halaman demi halaman secara mendetail (PDF/Gambar).
it: Apre il lettore documenti per un'analisi dettagliata pagina per pagina (PDF/Immagini).
pl: Otwiera czytnik dokumentów do szczegółowej analizy strona po stronie (PDF/obrazy).
pt_pt: Abre o Leitor de Documentos para uma análise detalhada página por página (PDF/Imagens).
ru: Открывает средство чтения документов для детального анализа постранично (PDF/изображения).
tr: Sayfa sayfa ayrıntılı analiz için Belge Okuyucuyu açar (PDF/Görseller).
uk: Відкриває читач документів для детального аналізу кожної сторінки (PDF/зображення).

source: Recognizes text from a selected image or PDF file.
fa: متن را از تصویر یا فایل PDF بازشناسی می‌کند.
fr: Reconnaît le texte d'une image ou d'un fichier PDF sélectionné.
id: Mengenali teks dari gambar atau file PDF yang dipilih.
it: Riconosce il testo da un'immagine o file PDF selezionato.
pl: Rozpoznaje tekst z wybranego obrazu lub pliku PDF.
pt_pt: Reconhece texto de uma imagem ou de um ficheiro PDF selecionado.
ru: Распознаёт текст из выбранного изображения или PDF-файла.
tr: Seçilen bir görüntüdeki veya PDF dosyasındaki metni tanır.
uk: Розпізнає текст із вибраного зображення або PDF-файлу.

source: Transcribes a selected audio file.
fa: فایلِ صوتیِ انتخاب‌شده را رونویسی می‌کند.
fr: Transcrit un fichier audio sélectionné.
id: Mentranskripsikan file audio yang dipilih.
it: Trascrive un file audio selezionato.
pl: Transkrybuje wybrany plik audio.
pt_pt: Transcreve um ficheiro de áudio selecionado.
ru: Расшифровывает выбранный аудиофайл.
tr: Seçilen bir ses dosyasını metne dönüştürür.
uk: Транскрибує вибраний аудіофайл.

source: Analyzes a YouTube, Instagram, Twitter or TikTok video URL.
fa: یک آدرسِ ویدئوی یوتیوب، اینستاگرام، توییتر یا تیکتاک را تحلیل می‌کند.
fr: Analyse l'adresse d'une vidéo YouTube, Instagram, Twitter ou TikTok.
id: Menganalisis URL video YouTube, Instagram, Twitter atau TikTok.
it: Analizza un URL video di YouTube, Instagram, Twitter o TikTok.
pl: Analizuje adres URL wideo z YouTube, Instagrama, Twittera lub TikToka.
pt_pt: Analisa uma URL de vídeo do YouTube, Instagram, Twitter ou TikTok.
ru: Анализирует видео по URL (YouTube, Instagram, Twitter или TikTok).
tr: Bir YouTube, Instagram, Twitter veya TikTok video Bağlantısını analiz eder.
uk: Аналізує URL-адресу відео YouTube, Instagram, Twitter або TikTok.

source: Attempts to solve a CAPTCHA on the screen or navigator object.
fa: تلاش می‌کند یک کپچا را روی صفحه یا پیمایشگر حل کند.
fr: Tente de résoudre un CAPTCHA sur l'écran ou l'objet navigateur.
id: Mencoba memecahkan CAPTCHA pada layar atau navigator object.
it: Cerca di risolvere un CAPTCHA sullo schermo o sull'oggetto navigatore.
pl: Próbuje rozwiązać CAPTCHA na ekranie lub w obiekcie nawigatora.
pt_pt: Tenta resolver um CAPTCHA no ecrã ou no objeto do navegador.
ru: Пытается решить CAPTCHA на экране или объекте навигатора.
tr: Ekrandaki veya dolaşım nesnesindeki CAPTCHA'yı çözmeyi dener.
uk: Спроби вирішити CAPTCHA на екрані або в об'єкті навігатора.

source: Records voice, transcribes it using AI, and types the result.
fa: صدا را ضبط کرده، با استفاده از هوشِ مصنوعی رونویسی و نتیجه را تایپ می‌کند.
fr: Enregistre la voix, la transcrit à l'aide de l'IA et écrit le résultat.
id: Merekam suara, mentranskripsikannya menggunakan AI, dan mengetik hasilnya.
it: Registra la voce, la trascrive usando l'IA e scrive il risultato.
pl: Nagrywa głos, transkrybuje go przy użyciu AI i wpisuje wynik.
pt_pt: Grava a voz, a transcreve usando IA e digita o resultado.
ru: Записывает голос, расшифровывает его с помощью ИИ и вводит результат.
tr: Sesi kaydeder, yapay zeka kullanarak metne dönüştürür ve sonucu yazar.
uk: Записує голос, транскрибує його за допомогою штучного інтелекту та друкує результат.

source: Announces the current status of the add-on.
fa: وضعیتِ فعلیِ افزونه را اعلام می‌کند.
fr: Annonce l'état actuel de l'extension.
id: Mengumumkan status add-on saat ini.
it: Annuncia lo stato corrente dell'add-on.
pl: Odczytuje bieżący stan dodatku.
pt_pt: Anuncia o status atual do complemento.
ru: Озвучивает текущий статус дополнения.
tr: Eklentinin mevcut durumunu seslendirir.
uk: Повідомляє про поточний стан додатка.

source: Checks for updates manually.
fa: بروزرسانی را دستی بررسی می‌کند.
fr: Vérifie les mises à jour manuellement.
id: Memeriksa pembaruan secara manual.
it: Controlla aggiornamenti manualmente.
pl: Ręcznie sprawdza dostępność aktualizacji.
pt_pt: Verifica atualizações manualmente.
ru: Проверяет обновления вручную.
tr: Güncellemeleri el ile denetler.
uk: Перевіряє наявність оновлень вручну.

source: Shows the last AI response in a chat dialog for review or follow-up questions.
fa: آخرین پاسخِ هوشِ مصنوعی را در پنجره‌ی گفتگو برای بررسی یا سؤالاتِ بعدی نشان می‌دهد.
fr: Affiche la dernière réponse de l'IA dans une fenêtre de discussion pour revue ou des questions additionnelles.
id: Menampilkan respons AI terakhir dalam dialog obrolan untuk ulasan atau pertanyaan lanjutan.
pl: Wyświetla ostatnią odpowiedź AI w oknie czatu do przeglądu lub zadawania dodatkowych pytań.
pt_pt: Mostra a última resposta da IA num diálogo de chat para revisão ou questões de acompanhamento.
tr: İnceleme veya takip soruları için sohbet iletişim kutusundaki son YZ yanıtını gösterir.
uk: Показує останню відповідь ШІ в діалозі чату для перегляду або додаткових запитань.

source: Shows a list of available commands in the layer.
fa: فرمان‌های موجود در لایه را نمایش می‌دهد.
fr: Affiche la liste des commandes séquentielles disponibles.
id: Menampilkan daftar lapisan perintah yang tersedia.
it: Mostra un elenco dei comandi disponibili nel layer comandi.
pl: Wyświetla listę dostępnych poleceń w warstwie.
pt_pt: Mostra uma lista de comandos disponíveis na camada.
ru: Показывает список доступных команд в слое.
tr: Katmandaki kullanılabilir komutların listesini gösterir.
uk: Показує список доступних команд у командному рівні.

source: {name} Help
fa: راهنمای {name}
fr: Aide {name}
id: Bantuan {name}
it: Aiuto {name}
pl: Pomoc {name}
pt_pt: Ajuda do {name}
ru: Справка {name}
tr: {name} Yardım
uk: Довідка {name}

source: File Upload Error: {error}
fa: خطای آپلودِ فایل: {error}
fr: Erreur de téléversement de fichier : {error}
id: Terjadi kesalahan saat mengunggah berkas {error}
it: Errore di caricamento file: {error}
pl: Błąd przesyłania pliku: {error}
pt_pt: Erro no envio do ficheiro: {error}
ru: Ошибка загрузки файла: {error}
tr: Dosya Yükleme Hatası: {error}
uk: Помилка відвантаження файлу: {error}

source: Nothing to send.
fa: چیزی برای ارسال وجود ندارد.
fr: Rien à envoyer.
id: Tidak ada yang perlu dikirim.
pl: Brak treści do wysłania.
pt_pt: Nada para enviar.
ru: Нечего отправить.
tr: Gönderilecek bir şey yok.
uk: Немає що відправляти.

source: Error: Response blocked by AI safety filters.
fa: خطا: پاسخ توسط فیلترهای امنیتیِ هوشِ مصنوعی مسدود شد.
fr: Erreur : réponse bloquée par les filtres de sécurité de l'IA.
id: Kesalahan: Respons diblokir oleh filter keamanan AI.
it: Errore: Risposta bloccata dai filtri di sicurezza AI.
pl: Błąd: odpowiedź zablokowana przez filtry bezpieczeństwa AI.
pt_pt: Erro: Resposta bloqueada por filtros de segurança de IA.
ru: Ошибка: ответ заблокирован фильтрами безопасности ИИ.
tr: Hata: Yanıt YZ güvenlik filtreleri tarafından engellendi.
uk: Помилка: відповідь заблоковано фільтрами безпеки ШІ.

source: Listening...
fa: در حالِ گوش دادن...
fr: À l'écoute...
id: Mendengarkan...
it: Ascolto...
pl: Nasłuchiwanie...
pt_pt: A ouvir…
ru: Прослушивание...
tr: Dinliyor...
uk: Слухаю...

source: Audio Hardware Error: {error}
fa: خطای سخت‌افزارِ صدا: {error}
fr: Erreur matérielle audio : {error}
id: Kesalahan Perangkat Keras Audio: {error}
it: Errore hardware audio: {error}
pl: Błąd sprzętu audio: {error}
pt_pt: Erro no Dispositivo de Áudio: {error}
ru: Ошибка аудиооборудования: {error}
tr: Ses Donanımı Hatası: {error}
uk: Помилка аудіообладнання: {error}

source: Typing...
fa: در حالِ نوشتن...
fr: Écriture en cours....
id: Mengetik...
it: Sta scrivendo...
pl: Wpisywanie...
pt_pt: Digitando...
ru: Ввод...
tr: Yazıyor...
uk: Друкую...

source: Save Recording Error: {error}
fa: خطا هنگامِ ذخیره‌ی صدای ضبط‌شده: {error}
fr: Erreur d'enregistrement : {error}
id: Kesalahan Penyimpanan Rekaman: {error}
it: Errore nel salvataggio della registrazione: {error}
pl: Błąd zapisu nagrania: {error}
pt_pt: Erro ao guardar a gravação: {error}
ru: Ошибка сохранения записи: {error}
tr: Kayıt Kaydetme Hatası: {error}
uk: Помилка збереження запису: {error}

source: No speech detected.
fa: گفتاری شناسایی نشد.
fr: Aucune parole détectée.
id: Tidak ada ucapan yang terdeteksi.
it: Nessuna voce riconosciuta.
pl: Nie wykryto mowy.
pt_pt: Nenhuma fala detetada.
ru: Речь не обнаружена.
tr: Konuşma algılanmadı.
uk: Мовлення не виявлено.

source: No speech recognized or Error.
fa: گفتار شناسایی نشد یا خطایی رخ داد.
fr: Aucune parole reconnue ou erreur.
id: Ucapan tidak dikenali atau Error.
it: Nessuna voce riconosciuta o errore.
pl: Nie rozpoznano mowy lub wystąpił błąd.
pt_pt: Nenhuma fala reconhecida ou ocorreu um erro.
ru: Речь не распознана или произошла ошибка.
tr: Konuşma tanınamadı veya Hata oluştu.
uk: Мовлення не розпізнано або сталася помилка.

source: Typed: {text}
fa: تایپ شد: {text}
fr: Saisie : {text}
id: Ketikkan: {text}
it: Digitato: {text}
pl: Wpisano: {text}
pt_pt: Digitado: {text}
ru: Введено: {text}
tr: Yazıldı: {text}
uk: Надруковано: {text}

source: No text found.
fa: متنی یافت نشد.
fr: Aucun texte trouvé.
id: Tidak ada teks yang ditemukan.
it: Nessun testo trovato.
pl: Brak tekstu.
pt_pt: Nenhum texto encontrado.
ru: Текст не найден.
tr: Metin bulunamadı.
uk: Текст не знайдено.

source: Translating...
fa: در حالِ ترجمه کردن...
fr: Traduction en cours...
id: Menerjemahkan...
it: Traduzione in corso...
pl: Tłumaczenie...
pt_pt: A traduzir…
ru: Перевод...
tr: Çevriliyor...
uk: Переклад...

source: Translated: {text}
fa: ترجمه شد: {text}
fr: Traduction : {text}
id: Diterjemahkan: {text}
it: Tradotto: {text}
pl: Przetłumaczono: {text}
pt_pt: Traduzido: {text}
ru: Переведено: {text}
tr: Çeviri: {text}
uk: Перекладено: {text}

source: {name} - Translation
fa: {name} - ترجمه
fr: {name} - Traduction
id: {name} - Terjemahan
pl: {name} - Tłumaczenie
pt_pt: {name} - Tradução
ru: {name} — Перевод
tr: {name} - Çeviri
uk: {name} - Переклад

source: Choose action:
fa: یک کار را انتخاب کنید:
fr: Choisir une action :
id: Pilih tindakan:
it: Scegli l'azione:
pl: Wybierz czynność:
pt_pt: Escolha uma ação:
ru: Выберите действие:
tr: Eylem seçin:
uk: Вибрати дію:

source: Processing...
fa: در حالِ پردازش...
fr: Traitement en cours...
id: Memproses...
it: Elaborazione...
pl: Przetwarzanie...
pt_pt: Processando...
ru: Обработка...
tr: İşleniyor...
uk: Обробка...

source: Uploading file...
fa: در حالِ آپلودِ فایل...
fr: Téléversement du fichier...
id: Mengunggah berkas...
it: Caricamento file...
pl: Przesyłanie pliku...
pt_pt: A enviar ficheiro…
ru: Загрузка файла...
tr: Dosya yükleniyor...
uk: Відвантаження файлу...

source: Analyzing...
fa: در حال تحلیل کردن...
fr: Analyse en cours...
id: Menganalisis...
it: Analisi in corso...
pl: Analizowanie...
pt_pt: A analisar…
ru: Анализ...
tr: Analiz ediliyor...
uk: Аналіз...

source: {name} - Refine Result
fa: {name} - نتیجه‌ی پالایش
fr: {name} - Résultat de l'assistant de texte
id: {name} - Hasil Penyempurnaan
it: {name} - Miglioramento risultati
pl: {name} - Wynik poprawiania
pt_pt: {name} - Resultado Refinado
ru: {name} — Результат обработки
tr: {name} - İyileştirme Sonucu
uk: {name} - Уточнити результат

source: Extracting Text...
fr: Extraction du texte...
id: Mengekstrak Teks...

source: Error creating PDF.
fa: خطا هنگامِ ایجادِ PDF.
fr: Erreur de création du PDF.
id: Terjadi kesalahan saat membuat PDF.
it: Errore nella creazione del pdf.
pl: Błąd tworzenia pliku PDF.
pt_pt: Erro ao criar PDF.
ru: Ошибка создания PDF.
tr: PDF oluşturulurken hata.
uk: Помилка створення PDF.

source: No text detected or error occurred.
fr: Aucun texte détecté ou une erreur s'est produite.
id: Tidak ada teks yang terdeteksi atau terjadi kesalahan.

source: {name} - Chat
fa: {name} - گفتگو
fr: {name} - Discussion
id: {name} - Obrolan
pl: {name} - Czat
ru: {name} — Чат
tr: {name} - Sohbet
uk: {name} - Чат

source: Scanning...
fa: در حالِ اسکن کردن...
fr: Analyse...
id: Memindai...
it: Scansione...
pl: Skanowanie...
pt_pt: Digitalizando...
ru: Сканирование...
tr: Taranıyor...
uk: Сканування...

source: Capture failed.
fa: گرفتنِ تصویر انجام نشد.
fr: Échec de la capture.
id: Pengambilan gagal.
it: Cattura fallita.
pl: Przechwytywanie nie powiodło się.
pt_pt: Falha na captura.
ru: Не удалось выполнить захват.
tr: Yakalama başarısız.
uk: Захоплення не вдалося.

source: {name} - Image Analysis
fa: {name} - تحلیلِ تصویر
fr: {name} - Analyse d'images
id: {name} - Analisis Gambar
it: {name} - Analisi immagini
pl: {name} - Analiza obrazu
pt_pt: {name} - Análise de Imagem
ru: {name} — Анализ изображения
tr: {name} - Görüntü Analizi
uk: {name} – Аналіз зображень

source: Uploading...
fa: در حالِ آپلود...
fr: Téléversement en cours...
id: Mengunggah...
it: Caricamento...
pl: Przesyłanie...
pt_pt: Enviando...
ru: Загрузка...
tr: Yükleniyor...
uk: Відвантаження...

source: Video analysis is only supported by Gemini providers.
fr: L'analyse vidéo n'est prise en charge que par les fournisseurs Gemini.
id: Analisis video hanya didukung oleh penyedia Gemini.

source: YouTube / Instagram / Twitter / TikTok Analysis
fa: تحلیلِ یوتیوب، اینستاگرام، توییتر یا تیکتاک
fr: Analyse YouTube / Instagram / Twitter / TikTok
id: Analisis YouTube / Instagram / Twitter / TikTok
it: Analisi per YouTube / Instagram / Twitter / TikTok
pl: Analiza YouTube / Instagram / Twitter / TikTok
pt_pt: Análise do YouTube / Instagram / Twitter / TikTok
ru: Анализ YouTube / Instagram / Twitter / TikTok
tr: YouTube / Instagram / Twitter / TikTok Analizi
uk: Аналіз YouTube / Instagram / Twitter / TikTok

source: Enter Video URL (YouTube/Instagram/Twitter/TikTok):
fa: آدرس ویدئو (یوتیوب، اینستاگرام، توییتر یا تیکتاک) را وارد کنید:
fr: Saisissez l'adresse de la vidéo (YouTube/Instagram/Twitter/TikTok) :
id: Masukkan URL Video (YouTube/Instagram/Twitter/TikTok):
it: Inserisci l'URL del video (YouTube/Instagram/Twitter/TikTok):
pl: Podaj adres URL wideo (YouTube/Instagram/Twitter/TikTok):
pt_pt: Insira o URL do vídeo (YouTube/Instagram/Twitter/TikTok):
ru: Введите URL видео (YouTube/Instagram/Twitter/TikTok):
tr: Video Bağlantısını girin (YouTube/Instagram/Twitter/TikTok):
uk: Введіть URL-адресу відео (YouTube/Instagram/Twitter/TikTok):

source: Error: Invalid URL.
fa: خطا: URL نامعتبر است.
fr: Erreur : adresse invalide.
id: Kesalahan: URL Tidak Valid.
it: Errore: URL non valido.
pl: Błąd: nieprawidłowy adres URL.
pt_pt: Erro: URL inválida.
ru: Ошибка: неверный URL.
tr: Hata: Geçersiz Bağlantı.
uk: Помилка: недійсна URL-адреса.

source: Error: Unsupported platform. Only YouTube, Instagram, Twitter, and TikTok are supported.
fa: خطا: پلتفورمِ پشتیبانی‌نشده. فقط از یوتیوب، اینستاگرام، توییتر و تیکتاک پشتیبانی می‌شود.
fr: Erreur : Plateforme non prise en charge. Seuls YouTube, Instagram, Twitter et TikTok sont pris en charge.
id: Kesalahan: Platform tidak didukung. Hanya YouTube, Instagram, Twitter, dan TikTok yang didukung.
it: Errore: Piattaforma non supportata. Sono supportati solo YouTube, Instagram, Twitter e TikTok.
pl: Błąd: nieobsługiwana platforma. Obsługiwane są tylko YouTube, Instagram, Twitter i TikTok.
pt_pt: Erro: Plataforma não suportada. Apenas YouTube, Instagram, Twitter e TikTok são suportados.
ru: Ошибка: неподдерживаемая платформа. Поддерживаются только YouTube, Instagram, Twitter и TikTok.
tr: Hata: Desteklenmeyen platform. Yalnızca YouTube, Instagram, Twitter ve TikTok desteklenmektedir.
uk: Помилка: платформа не підтримується. Підтримуються лише YouTube, Instagram, Twitter і TikTok.

source: Processing Video...
fa: در حالِ پردازشِ ویدئو...
fr: Traitement de la vidéo en cours...
id: Memproses Video...
it: Elaborazione video...
pl: Przetwarzanie wideo...
pt_pt: A processar o vídeo...
ru: Обработка видео...
tr: Video işleniyor...
uk: Обробка відео...

source: Error: Could not extract Instagram video.
fa: خطا: نتوانستم ویدئوی اینستاگرام را استخراج کنم.
fr: Erreur : Impossible d'extraire la vidéo Instagram.
id: Kesalahan: Tidak dapat mengekstrak video Instagram.
it: Errore: Non è stato possibile estrarre il video di Instagram.
pl: Błąd: nie udało się pobrać wideo z Instagrama.
pt_pt: Erro: Não foi possível extrair o vídeo do Instagram.
ru: Ошибка: не удалось извлечь видео из Instagram.
tr: Hata: Instagram videosu ayıklanamadı.
uk: Помилка: не вдалося видобути відео Instagram.

source: Error: Could not extract Twitter video.
fa: خطا: نتوانستم ویدئوی توییتر را استخراج کنم.
fr: Erreur : Impossible d'extraire la vidéo Twitter.
id: Kesalahan: Tidak dapat mengekstrak video Twitter.
it: Errore: Non è stato possibile estrarre il video di Twitter.
pl: Błąd: nie udało się pobrać wideo z Twittera.
pt_pt: Erro: Não foi possível extrair o vídeo do Twitter.
ru: Ошибка: не удалось извлечь видео из Twitter.
tr: Hata: Twitter videosu ayıklanamadı.
uk: Помилка: не вдалося видобути відео Twitter.

source: Error: Could not extract TikTok video.
fa: خطا: نتوانستم ویدئوی تیکتاک را استخراج کنم.
fr: Erreur : Impossible d'extraire la vidéo Tiktok.
id: Kesalahan: Tidak dapat mengekstrak video TikTok.
it: Errore: Non è stato possibile estrarre il video di TikTok.
pl: Błąd: nie udało się pobrać wideo z TikToka.
pt_pt: Não foi possível obter o vídeo do TikTok.
ru: Ошибка: не удалось извлечь видео из TikTok.
tr: Hata: TikTok videosu ayıklanamadı.
uk: Помилка: не вдалося видобути відео TikTok.

source: Downloading Video...
fa: در حالِ دانلودِ ویدئو...
fr: Téléchargement de la vidéo en cours...
id: Mengunduh Video...
it: Sto scaricando il video...
pl: Pobieranie wideo...
pt_pt: A baixar o vídeo...
ru: Загрузка видео...
tr: Video indiriliyor...
uk: Завантаження відео...

source: Error: Download failed.
fa: خطا: دانلود انجام نشد.
fr: Erreur : échec du téléchargement.
id: Kesalahan: Pengunduhan gagal.
it: Errore: Download fallito.
pl: Błąd: pobieranie nie powiodło się.
pt_pt: Erro: Falha no descarregamento.
ru: Ошибка: не удалось загрузить.
tr: Hata: İndirme başarısız.
uk: Помилка: Помилка завантаження.

source: Uploading to AI...
fa: در حالِ آپلود به هوشِ مصنوعی...
fr: Téléversement vers l'IA en cours...
id: Mengunggah ke AI...
it: Caricamento su AI...
pl: Przesyłanie do AI...
pt_pt: Carregando para a IA...
ru: Загрузка в ИИ...
tr: YZ'ye yükleniyor...
uk: Відвантаження до ШІ...

source: Analyzing YouTube...
fa: در حال تحلیل کردنِ یوتیوب...
fr: Analyse de la vidéo YouTube en cours...
id: Menganalisis YouTube...
it: Analisi di YouTube...
pl: Analizowanie YouTube...
pt_pt: A analisar o YouTube...
ru: Анализ YouTube...
tr: YouTube analiz ediliyor...
uk: Аналіз YouTube...

source: Solving...
fa: در حالِ حل کردن...
fr: Résolution en cours...
id: Memecahkan...
it: Risolvo...
pl: Rozwiązywanie...
pt_pt: A resolver...
ru: Решение...
tr: Çözülüyor...
uk: Вирішення...

source: No CAPTCHA detected.
fa: کپچا شناسایی نشد.
fr: Aucun CAPTCHA détectée.
id: Tidak ada CAPTCHA yang terdeteksi.
it: Nessun CAPTCHA rilevato.
pl: Nie wykryto CAPTCHA.
pt_pt: Nenhum CAPTCHA detetado.
ru: CAPTCHA не обнаружена.
tr: CAPTCHA algılanmadı.
uk: CAPTCHA не виявлено.

source: Checking for updates...
fa: در حالِ بررسی برای بروزرسانی...
fr: Vérification des mises à jour...
id: Memeriksa pembaruan...
it: Controllo aggiornamenti...
pl: Sprawdzanie aktualizacji...
pt_pt: Verificando actualizações...
ru: Проверка обновлений...
tr: Güncellemeler denetleniyor...
uk: Перевірка оновлень...

source: Translating Clipboard...
fa: در حالِ ترجمه کردنِ کلیپ‌برد...
fr: Traduction du Presse-papiers en cours...
id: Menerjemahkan teks dari papan klip...
it: Traduzione appunti...
pl: Tłumaczenie schowka...
pt_pt: Traduzindo área de transferência...
ru: Перевод из буфера обмена...
tr: Pano çevriliyor...
uk: Переклад буфера обміну...

source: Clipboard empty.
fa: کلیپ‌برد خالی است.
fr: Le presse-papiers est vide.
id: Papan klip kosong.
it: Appunti vuoti.
pl: Schowek jest pusty.
pt_pt: Área de transferência vazia.
ru: Буфер обмена пуст.
tr: Pano boş.
uk: Буфер обміну порожній.

source: No previous result to show.
fa: هیچ نتیجه‌ی قبلی برای نمایش وجود ندارد.
fr: Aucun résultat précédent à afficher.
id: Tidak ada hasil sebelumnya untuk ditampilkan.
pl: Brak poprzedniego wyniku do wyświetlenia.
pt_pt: Não existe nenhum resultado anterior para mostrar.
tr: Gösterilecek önceki sonuç yok.
uk: Немає попередніх результатів для показу.
