Repository: muhammadGagah/VisionAssistantPro
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fa, fr, id, it, pl, pt_pt, ru, tr, uk

source: Copy TON Address
fa: کپی کردنِ آدرسِ TON
fr: Copier l'adresse TON
id: Salin Alamat TON
it: Copia indirizzo TON
pl: Kopiuj adres TON
pt_pt: Copiar endereço TON
ru: Скопировать адрес TON
tr: TON Adresini Kopyala
uk: Копіювати адресу TON

source: Copy USDT (TRC20) Address
fa: کپی کردنِ آدرسِ USDT (TRC20)
fr: Copier l'adresse USDT (TRC20)
id: Salin Alamat USDT (TRC20)
it: Copia indirizzo USDT (TRC20)
pl: Kopiuj adres USDT (TRC20)
pt_pt: Copiar endereço USDT (TRC20)
ru: Скопировать адрес USDT (TRC20)
tr: USDT (TRC20) Adresini Kopyala
uk: Копіювати адресу USDT (TRC20)

source: Copy Support Email
fa: کپی کردنِ آدرسِ ایمیل برای حمایت
fr: Copier l'e-mail pour me soutenir
id: Salin Email Dukungan
pl: Kopiuj adres e-mail wsparcia
pt_pt: Copiar e-mail de suporte
ru: Скопировать письмо поддержки
tr: Destek E-postasını Kopyala
uk: Копіювати електронну адресу підтримки

source: Maybe Later
fa: بعدا انجام میدهم
fr: Peut-être plus tard
id: Nanti Saja
it: Forse più tardi
pl: Może później
pt_pt: Talvez mais tarde
ru: Возможно позже
tr: Belki Daha Sonra
uk: Можливо пізніше

source: Copied to clipboard! Your support is greatly appreciated!
fa: در کلیپ‌برد کپی شد! قدردانِ حمایتِ شما هستیم!
fr: Copié dans le presse-papiers ! Votre soutien est grandement apprécié !
id: Disalin ke papan klip! Dukungan Anda sangat dihargai!
pl: Skopiowano do schowka! Twoje wsparcie jest bardzo ważne!
pt_pt: Copiado para a área de transferência! Agradecemos imenso o seu apoio!
ru: Скопировано в буфер обмена! Ваша поддержка очень ценна!
tr: Panoya kopyalandı! Desteğiniz taktir ediliyor!
uk: Скопійовано в буфер обміну! Ми дуже вдячні за вашу підтримку!

source: Success
fa: موفق
fr: Succès
id: Berhasil
it: Fatto
pl: Sukces
pt_pt: Sucesso
ru: Успешно
tr: Başarılı
uk: Успіх

source: Support the Future of {name}
fa: از آینده‌ی {name} حمایت کنید
fr: Soutenez l’avenir de {name}
id: Dukung Masa Depan {name}
it: Supporta lo sviluppo di {name}
pl: Wesprzyj przyszłość {name}
pt_pt: Apoie o futuro do {name}
ru: Поддержите будущее {name}
tr: {name} Geleceğini Destekle
uk: Підтримайте майбутнє {name}

source: {name} is a project born from a personal vision to bridge the gap between AI and true accessibility. The initial concept and many of the features you enjoy were created from my own ideas to solve real challenges and provide a new level of digital independence. I take great pride in thinking through every detail and turning both my own innovations and your valuable requests into reality. Ensuring this tool remains fast, stable, and constantly evolving is a continuous creative journey that I am passionate about pursuing. Important Note: Due to international banking restrictions in my region, I am unable to use PayPal or Stripe. If you wish to support this project, you can donate via Cryptocurrency or by sending an Apple Gift Card (US region) to: {email} If this assistant has brought value to your daily life, your support is a wonderful way to show appreciation for the original work and the dedication behind it. Thank you for being part of this mission!
fa: {name} پروژه‌ای است که از یک دیدگاهِ شخصی برای پر کردنِ شکافِ میانِ هوشِ مصنوعی و دسترسیِ واقعی متولد شده است. مفهومِ اولیه و بسیاری از ویژگی‌هایی که از آن‌ها لذت می‌بَرید، از ایده‌های شخصیِ من برای حلِ چالش‌های واقعی و ارائه‌ی سطحِ جدیدی از استقلالِ دیجیتال ایجاد شده‌اند. من افتخار می‌کنم که به تمامِ جزئیات فکر کرده‌ام و هم نوآوری‌های خودم و هم درخواست‌های ارزشمندِ شما را به واقعیت تبدیل کرده‌ام. اطمینان از اینکه این ابزار سریع، پایدار و در حالِ تکامل باقی بماند، یک سفرِ خلاقانه‌ی مستمر است که من با اشتیاق آن را دنبال می‌کنم. نکته‌ی مهم: به دلیلِ محدودیت‌های بانکی بین‌المللی در منطقه‌ی من، نمی‌توانم از PayPal یا Stripe استفاده کنم. اگر مایل به حمایت از این پروژه هستید، می‌توانید از طریق ارزِ دیجیتال یا با ارسالِ یک کارتِ هدیه‌ی اپل (منطقه‌ی ایالات متحده) به این آدرس کمک کنید: {email} اگر این دستیار ارزشی به زندگیِ روزانه‌ی شما افزوده است، حمایتِ شما راهی فوق‌العاده برای قدردانی از کارِ اصلی و تعهدِ پشتِ آن است. از اینکه بخشی از این مأموریت هستید، سپاسگزارم!
fr: {name} est un projet né d'une vision personnelle visant à combler le fossé entre l'IA et la véritable accessibilité. Le concept initial et la plupart des fonctionnalités dont vous profitez ont été créés à partir de mes propres idées pour résoudre de des difficultés réelles et offrir un nouveau niveau d'indépendance numérique. Je suis très fier de réfléchir à chaque détail et de transformer mes propres innovations et vos précieuses demandes en réalité. Veiller à ce que cet outil reste rapide, stable et en constante évolution est un voyage créatif continu que je suis passionné à poursuivre. Remarque importante : en raison des restrictions bancaires internationales dans ma région, je ne peux pas utiliser PayPal ou Stripe. Si vous souhaitez soutenir ce projet, vous pouvez faire un don via Crypto-monnaie ou en envoyant une carte cadeau Apple (région des États-Unis) à : {email} Si cet assistant a apporté de la valeur à votre vie quotidienne, votre soutien est une merveilleuse façon de montrer votre appréciation pour le travail original et le dévouement qui le sous-tend. Merci de faire partie de cette mission !
id: {name} adalah proyek yang lahir dari visi pribadi untuk menjembatani kesenjangan antara AI dan aksesibilitas sebenarnya. Konsep awal dan banyak fitur yang Anda nikmati diciptakan dari ide saya sendiri untuk memecahkan tantangan nyata dan memberikan tingkat kemandirian digital yang baru. Saya sangat bangga memikirkan setiap detail dan mewujudkan inovasi saya dan permintaan berharga Anda menjadi kenyataan. Memastikan alat ini tetap cepat, stabil, dan terus berkembang adalah perjalanan kreatif berkelanjutan yang ingin saya lakukan. Catatan Penting: Karena pembatasan perbankan internasional di wilayah saya, saya tidak dapat menggunakan PayPal atau Stripe. Jika Anda ingin mendukung proyek ini, Anda dapat berdonasi melalui Cryptocurrency atau dengan mengirimkan Kartu Hadiah Apple (wilayah AS) ke: {email} Jika asisten ini telah memberikan nilai bagi kehidupan Anda sehari-hari, dukungan Anda adalah cara yang bagus untuk menunjukkan penghargaan atas karya asli dan dedikasi di baliknya. Terima kasih telah menjadi bagian dari misi ini!
pl: {name} to projekt zrodzony z osobistej wizji, by zbliżyć sztuczną inteligencję do prawdziwej dostępności. Pierwotna koncepcja i wiele funkcji, z których korzystasz, powstały z moich własnych pomysłów, by rozwiązywać realne problemy i zapewnić nowy poziom cyfrowej niezależności. Z dumą dopracowuję każdy szczegół, zamieniając zarówno własne innowacje, jak i Wasze cenne sugestie w rzeczywistość. Dbanie o to, by narzędzie pozostawało szybkie, stabilne i stale się rozwijało, to nieustanna twórcza podróż, którą realizuję z pasją. Ważna uwaga: ze względu na międzynarodowe ograniczenia bankowe w moim regionie nie mogę korzystać z PayPal ani Stripe. Jeśli chcesz wesprzeć ten projekt, możesz przekazać darowiznę w kryptowalucie lub wysłać kartę podarunkową Apple (region US) na adres: {email} Jeśli ten asystent wniósł wartość do Twojego codziennego życia, Twoje wsparcie jest wspaniałym sposobem na docenienie włożonej pracy i zaangażowania. Dziękuję, że jesteś częścią tej misji!
pt_pt: {name} é um projeto que nasceu de uma visão pessoal para reduzir a distância entre a inteligência artificial e a acessibilidade real. O conceito inicial e muitas das funcionalidades que utiliza foram criados a partir das minhas próprias ideias, com o objetivo de resolver desafios concretos e proporcionar um novo nível de independência digital. Tenho muito orgulho em conceber cada detalhe e em transformar tanto as minhas próprias inovações como as suas valiosas sugestões em realidade. Garantir que esta ferramenta continue rápida, estável e em constante evolução é uma jornada criativa contínua, que sigo com grande dedicação e entusiasmo. Observação importante: devido a restrições bancárias internacionais na minha região, não consigo usar PayPal ou Stripe. Se desejar apoiar este projeto, você pode doar via criptomoeda ou enviando um vale-presente da Apple (região dos EUA) para: {email}n Se este assistente trouxe valor ao seu dia a dia, o seu apoio é uma excelente forma de demonstrar apreço pelo trabalho original e pela dedicação que lhe está subjacente. Esse apoio oferece motivação adicional para manter a inspiração viva e assegura que possamos continuar a expandir limites em conjunto. Obrigado por fazer parte desta missão!
ru: {name} — проект, рожденный из личной идеи соединить мир искусственного интеллекта и истинной доступности. Исходная концепция и многие из функций, которыми вы пользуетесь, были созданы мной для решения реальных проблем и предоставления нового уровня цифровой самостоятельности. Я горжусь тем, что уделяю внимание каждой детали и воплощаю как собственные инновационные подходы, так и ваши ценные пожелания в реальность. Обеспечение того, чтобы этот инструмент оставался быстрым, стабильным и постоянно развивался, является творческим путешествием, которое я страстно продолжаю. Важно отметить: из-за международных банковских ограничений в моем регионе я не могу пользоваться услугами PayPal или Stripe. Если вы хотите поддержать этот проект, можете сделать пожертвование криптовалютой или отправить подарочную карту Apple (регион США) на адрес электронной почты: {email}. Если этот помощник принес пользу вашей повседневной жизни, ваша поддержка станет прекрасным способом выразить признательность за оригинальную работу и преданность делу. Спасибо, что вы участвуете в этой миссии!"
tr: {name}, yapay zeka ile gerçek erişilebilirlik arasındaki boşluğu doldurmaya yönelik kişisel bir vizyondan doğan bir projedir. Başlangıç ​​konsepti ve hoşunuza giden özelliklerin çoğu, gerçek zorlukları çözmek ve yeni bir dijital bağımsızlık düzeyi sağlamak için kendi fikirlerimden oluşturuldu. Her detayı düşünüp hem kendi yeniliklerimi hem de sizlerin değerli isteklerini gerçeğe dönüştürmekten büyük gurur duyuyorum. Bu aracın hızlı, istikrarlı kalmasını ve sürekli gelişmesini sağlamak, tutkuyla takip ettiğim sürekli bir yaratıcı yolculuktur. Önemli Not: Bölgemdeki uluslararası bankacılık kısıtlamaları nedeniyle PayPal veya Stripe'ı kullanamıyorum. Bu projeyi desteklemek istiyorsanız Kripto Para birimi aracılığıyla veya şu adrese bir Apple Hediye Kartı (ABD bölgesi) göndererek bağışta bulunabilirsiniz: {email} Bu asistan günlük yaşamınıza değer kattıysa, desteğiniz orijinal çalışmaya ve onun arkasındaki özveriye olan takdirinizi göstermenin harika bir yoludur. Bu misyonun bir parçası olduğunuz için teşekkür ederiz!
uk: {name} — це проект, що виник з особистої ідеї подолати розрив між штучним інтелектом та справжньою доступністю. Початкова концепція та багато функцій, якими ви користуєтеся, були створені на основі моїх власних ідей для вирішення реальних проблем та забезпечення нового рівня цифрової незалежності. Я пишаюся тим, що продумую кожну деталь і втілюю в життя як свої власні інновації, так і ваші цінні побажання. Забезпечення швидкої, стабільної роботи та постійного розвитку цього інструменту — це безперервна творча подорож, якою я захоплено займаюся. Важлива примітка: через міжнародні банківські обмеження в моєму регіоні я не можу використовувати PayPal або Stripe. Якщо ви бажаєте підтримати цей проект, ви можете зробити пожертву за допомогою криптовалюти або надіславши подарункову картку Apple (регіон США) на адресу: {email}. Якщо цей помічник приніс користь у ваше повсякденне життя, ваша підтримка — це чудовий спосіб висловити вдячність за оригінальну роботу та відданість справі. Це надає додаткову мотивацію, щоб зберегти натхнення, і гарантує, що ми зможемо разом продовжувати розширювати межі. Дякую, що ви є частиною цієї місії!

source: Name:
fa: نام:
fr: Nom :
id: Nama:
pl: Nazwa:
pt_pt: Nome:
ru: Имя:
tr: Ad:
uk: Назва:

source: Prompt Text:
fa: متنِ پرامپت:
fr: Texte du prompt :
id: Teks Perintah:
pl: Treść Promptu:
pt_pt: Texto do Prompt:
ru: Текст запроса:
tr: İstem Metni:
uk: Текст підказки:

source: Variables Guide
fa: راهنمای متغیرها
fr: Guide des variables
id: Panduan Variabel
pl: Przewodnik po zmiennych
pt_pt: Guia de Variáveis
ru: Руководство по переменным
tr: Değişkenler Kılavuzu
uk: Посібник зі змінних

source: Name cannot be empty.
fa: نام نمی‌تواند خالی باشد.
fr: Le nom ne peut pas être vide.
id: Nama tidak boleh kosong.
pl: Nazwa nie może być pusta.
pt_pt: O nome não pode estar vazio.
ru: Имя не может быть пустым.
tr: Ad alanı boş olamaz.
uk: Назва не може бути пустою.

source: Validation Error
fa: خطای اعتبارسنجی
fr: Erreur de validation
id: Kesalahan Validasi
pl: Błąd walidacji
pt_pt: Erro de validação
ru: Ошибка проверки
tr: Doğrulama Hatası
uk: Помилка перевірки

source: Prompt text cannot be empty.
fa: متنِ پرامپت نمی‌تواند خالی باشد.
fr: Le texte du prompt ne peut pas être vide.
id: Teks perintah tidak boleh kosong.
pl: Treść polecenia nie może być pusta.
pt_pt: O texto do prompt não pode estar vazio.
ru: Текст запроса не может быть пустым.
tr: İstem metni boş olamaz.
uk: Текст підказки не може бути порожнім.

source: Prompt Variables Guide
fa: راهنمای متغیرهای پرامپت
fr: Guide des variables du prompt
id: Panduan Variabel Prompt
pl: Przewodnik po zmiennych poleceń
pt_pt: Guia de variáveis de prompt
ru: Руководство по переменным запроса
tr: İstem Değişkenleri Kılavuzu
uk: Довідник змінних підказки

source: Use these variables inside prompt text:
fa: از این متغیرها داخلِ متنِ پرامپت استفاده کنید:
fr: Utilisez ces variables dans le texte du prompt :
id: Gunakan variabel berikut di dalam teks prompt:
pl: Użyj tych zmiennych wewnątrz treści polecenia:
pt_pt: Use estas variáveis dentro do texto do prompt:
ru: Используйте эти переменные внутри текста запроса:
tr: İstem metninde şu değişkenleri kullanın:
uk: Використовуйте ці змінні в тексті підказки:

source: Close
fa: بستن
fr: Fermer
id: Tutup
it: Chiudi
pl: Zamknij
pt_pt: Fechar
ru: Закрыть
tr: Kapat
uk: Закрити

source: Prompt Manager
fa: مدیرِ پرامپت
fr: Gestionnaire de prompts
id: Pengelola Prompt
pl: Menedżer poleceń
pt_pt: Gestor de Prompts
ru: Менеджер запросов
tr: İstem Yöneticisi
uk: Менеджер підказок

source: Default Prompts
fa: پرامپت‌های پیش‌فرض
fr: Prompts par défaut
id: Perintah Bawaan
pl: Polecenia domyślne
pt_pt: Prompts Predefinidos
ru: Запросы по умолчанию
tr: Varsayılan İstemler
uk: Початкові підказки

source: Custom Prompts
fa: پرامپت‌های سفارشی
fr: Prompts personnalisés
id: Perintah Kustom
it: Prompt personalizzati
pl: Polecenia niestandardowe
pt_pt: Prompts Personalizados
ru: Пользовательские запросы
tr: Özel İstemler
uk: Користувацькі підказки

source: Changes are applied only when you press OK.
fa: تغییرات فقط زمانی اِعمال می‌شوند که «تایید» را فشار دهید.
fr: Les modifications sont appliquées uniquement lorsque vous appuyez sur OK.
id: Perubahan hanya diterapkan bila Anda menekan OK.
pl: Zmiany zostaną zastosowane dopiero po naciśnięciu OK.
pt_pt: As alterações são aplicadas apenas quando premir OK.
ru: Изменения применяются только при нажатии кнопки OK.
tr: Değişiklikler yalnızca Tamam'a bastığınızda uygulanır.
uk: Зміни застосовуються лише після натискання ОК.

source: Reset Selected
fa: بازنشانیِ انتخاب‌شده‌ها
fr: Réinitialiser la sélection
id: Atur Ulang Pilihan
pl: Resetuj wybrane
pt_pt: Reiniciar Selecionados
ru: Сбросить выбранный
tr: Seçileni Sıfırla
uk: Скинути вибране

source: Reset All
fa: بازنشانیِ همه
fr: Tout réinitialiser
id: Atur Ulang Semua
pl: Resetuj wszystkie
pt_pt: Reiniciar Tudo
ru: Сбросить всё
tr: Tümünü Sıfırla
uk: Скинути все

source: Apply to Selected
fa: اِعمال کردن به انتخاب‌شده‌ها
fr: Appliquer à la sélection
id: Terapkan ke Pilihan
pl: Zastosuj do wybranego
pt_pt: Aplicar aos selecionados
ru: Применить к выбранному
tr: Seçilenlere Uygula
uk: Застосувати до вибраного

source: Add
fa: افزودن
fr: Ajouter
id: Tambahkan
pl: Dodaj
pt_pt: Adicionar
ru: Добавить
tr: Ekle
uk: Додати

source: Remove
fa: حذف کردن
fr: Supprimer
id: Hapus
pl: Usuń
pt_pt: Remover
ru: Удалить
tr: Kaldır
uk: Видалити

source: Move Up
fa: بالا بردن
fr: Monter
id: Pindah ke Atas
pl: Przesuń w górę
pt_pt: Mover Para Cima
ru: Переместить вверх
tr: Yukarı Taşı
uk: Перемістити вгору

source: Move Down
fa: پایین بردن
fr: Descendre
id: Pindah ke Bawah
pl: Przesuń w dół
pt_pt: Mover para baixo
ru: Переместить вниз
tr: Aşağı Taşı
uk: Перемістити вниз

source: Prompt Preview:
fa: پیش‌نمایشِ پرامپت:
fr: Aperçu du prompt :
id: Pratinjau Perintah:
pl: Podgląd polecenia:
pt_pt: Pré-visualização do Prompt:
ru: Предпросмотр запроса:
tr: İstem Önizlemesi:
uk: Попередній перегляд підказки:

source: This prompt is used by {feature}. To save it, add the required text below:
fa: این پرامپت توسط {feature} استفاده می‌شود. برای ذخیره کردنِ آن، متنِ موردِ نیاز را در زیر اضافه کنید:
fr: Ce prompt est utilisé par {feature}. Pour l'enregistrer, ajoutez le texte requis ci-dessous :
id: Prompt ini digunakan oleh {feature}. Untuk menyimpannya, tambahkan teks yang diperlukan di bawah ini:
pl: Ten prompt jest używany przez funkcję {feature}. Aby go zapisać, dodaj wymagany tekst poniżej:
pt_pt: Este prompt é utilizado por {feature}. Para o guardar, adicione o texto obrigatório abaixo:
tr: Bu istem {feature} tarafından kullanılır. Kaydetmek için aşağıya gerekli metni ekleyin:
uk: Ця підказка використовується {feature}. Щоб зберегти її, додайте необхідний текст нижче:

source: Add these items exactly as written, then try again.
fa: این موارد را دقیقاً همانطور که نوشته شده اضافه، سپس دوباره امتحان کنید.
fr: Ajoutez ces éléments exactement comme écrit, puis réessayez.
id: Tambahkan item ini persis seperti yang tertulis, lalu coba lagi.
pl: Dodaj te elementy dokładnie tak, jak podano, a następnie spróbuj ponownie.
pt_pt: Adicione estes itens exatamente como estão escritos e, em seguida, tente novamente.
tr: Bu öğeleri tam olarak yazıldığı gibi ekleyin ve tekrar deneyin.
uk: Додайте ці елементи точно так, як написано, а потім повторіть спробу.

source: Required Text Missing
fa: متنِ موردِ نیاز موجود نیست
fr: Texte requis manquant
id: Teks yang Diperlukan Tidak Ada
pl: Brak wymaganego tekstu
pt_pt: Texto Obrigatório em Falta
tr: Gerekli Metin Eksik
uk: Відсутній необхідний текст

source: You are editing a prompt used by {feature}. If this prompt is changed, this feature may not work correctly. Do you understand the risk and want to save anyway?
fa: شما در حالِ ویرایشِ یک پرامپتِ استفاده‌شده توسط {feature} هستید. اگر این پرامپت تغییر کند، ممکن است این ویژگی به درستی کار نکند. آیا خطر را درک کرده و می‌خواهید به هر حال ذخیره کنید؟
fr: Vous souhaitez modifier un prompt utilisée par {feature}. Si ce prompt est modifié, cette fonctionnalité risque de ne pas fonctionner correctement. Comprenez-vous le risque et souhaitez-vous quand même l'enregistrer ?
id: Anda sedang mengedit perintah yang digunakan oleh {feature}. Jika perintah ini diubah, fitur ini mungkin tidak berfungsi dengan benar. Apakah Anda memahami risikonya dan tetap ingin menyimpan?
pl: Edytujesz prompt używany przez funkcję {feature}. Jeśli ten prompt zostanie zmieniony, ta funkcja może nie działać poprawnie. Czy rozumiesz ryzyko i mimo to chcesz zapisać?
pt_pt: Está a editar um prompt utilizado por {feature}. Se este prompt for alterado, esta funcionalidade pode não funcionar corretamente. Compreende o risco e pretende guardar mesmo assim?
tr: {feature} tarafından kullanılan bir istemi düzenliyorsunuz. Bu istem değiştirilirse bu özellik düzgün çalışmayabilir. Riski anlıyor ve yine de kaydetmek istiyor musunuz?
uk: Ви редагуєте підказку, яку використовує {feature}. Якщо цю підказку змінити, ця функція може не працювати належним чином. Ви розумієте ризик і все одно хочете зберегти?

source: Confirm
fa: تایید
fr: Confirmer
id: Konfirmasi
pl: Potwierdź
pt_pt: Confirmar
tr: Onayla
uk: Підтвердити

source: Yes, Save Anyway
fa: بله، به هر حال ذخیره کن
fr: Oui, enregistrez quand même
id: Ya, Tetap Simpan
pl: Tak, zapisz mimo to
pt_pt: Sim, Guardar Mesmo Assim
tr: Evet, Yine de Kaydet
uk: Так, все одно зберегти

source: No, Go Back
fa: نه، برگرد
fr: Non, Retourner en arrière
id: Tidak, Kembali
pl: Nie, wróć
pt_pt: Não, Voltar Atrás
tr: Hayır, Geri Dön
uk: Ні, повернутися

source: Selected prompt updated.
fa: پرامپتِ انتخاب‌شده بروز شد.
fr: Prompt sélectionné mis à jour.
id: Prompt yang dipilih telah diperbarui.
pl: Wybrane polecenie zaktualizowane.
pt_pt: Prompt selecionado atualizado.
ru: Выбранный запрос обновлён.
tr: Seçili istem güncellendi.
uk: Вибрану підказку оновлено.

source: Reset all default prompts to built-in values?
fa: همه‌ی پرامپت‌های پیش‌فرض به مقادیرِ داخلیِ افزونه بازنشانی شوند؟
fr: Réinitialiser tous les prompts par défaut aux valeurs d'origine ?
id: Setel ulang semua perintah default ke nilai bawaan?
pl: Przywrócić wszystkie domyślne polecenia do wartości domyślnych?
pt_pt: Repor todos os prompts predefinidos para os valores incorporados?
ru: Сбросить все запросы по умолчанию до встроенных значений?
tr: Tüm varsayılan istemler dahili değerlere sıfırlansın mı?
uk: Скинути всі підказки до вбудованих значень?

source: Confirm Reset
fa: تاییدِ بازنشانی
fr: Confirmer la réinitialisation
id: Konfirmasi Reset
pl: Potwierdź reset
pt_pt: Confirmar Reposição
ru: Подтверждение сброса
tr: Sıfırlamayı Onayla
uk: Підтвердити Скидання

source: Add Custom Prompt
fa: افزودنِ پرامپتِ سفارشی
fr: Ajouter un prompt personnalisé
id: Tambahkan Prompt Kustom
pl: Dodaj polecenie niestandardowe
pt_pt: Adicionar Prompt Personalizado
ru: Добавить пользовательский запрос
tr: Özel İstem Ekle
uk: Додати користувацькі підказки

source: A custom prompt with this name already exists.
fa: یک پرامپتِ سفارشی با این نام از پیش وجود دارد.
fr: Un prompt personnalisé portant ce nom existe déjà.
id: Permintaan khusus dengan nama ini sudah ada.
pl: Polecenie niestandardowe o tej nazwie już istnieje.
pt_pt: Já existe um prompt personalizado com este nome.
ru: Пользовательский запрос с таким именем уже существует.
tr: Bu ada sahip özel bir istem zaten mevcut.
uk: Користувацька підказка з такою назвою вже існує.

source: Edit Custom Prompt
fa: ویرایش کردنِ پرامپتِ سفارشی
fr: Modifier le prompt personnalisée
id: Edit Perintah Kustom
pl: Edytuj polecenie niestandardowe
pt_pt: Editar Prompt Personalizado
ru: Редактировать пользовательский запрос
tr: Özel İstemi Düzenle
uk: Редагувати користувацькі підказки

source: Remove custom prompt '{name}'?
fa: پرامپتِ سفارشیِ '{name}' را حذف می‌کنید؟
fr: Supprimer le prompt personnalisé "{name}" ?
id: Hapus perintah khusus '{name}'?
pl: Usunąć polecenie niestandardowe "{name}"?
pt_pt: Remover o prompt personalizado '{name}'?
ru: Удалить пользовательский запрос '{name}'?
tr: '{name}' özel istemi kaldırılsın mı?
uk: Видалити користувацьку підказку "{name}"?

source: Confirm Remove
fa: تاییدِ حذف
fr: Confirmer la suppression
id: Konfirmasi Hapus
pl: Potwierdź usunięcie
pt_pt: Confirmar Remoção
ru: Подтверждение удаления
tr: Kaldırmayı Onayla
uk: Підтвердити видалення

source: [Auto]
fa: [بروزرسانیِ خودکار]
id: [Otomatis]
pt_pt: [Automático]
ru: [Авто]
uk: [Авто]

source: (Latest)
fa: (جدیدترین)
fr: (Dernière version)
id: (Terbaru)
it: (ultima versione)
pl: (Najnowszy)
pt_pt: (Mais recente)
ru: (Последняя)
tr: (En son)
uk: (Остання)

source: [Free]
fa: [رایگان]
fr: [Gratuit]
id: [Gratis]
it: [Gratuito]
pl: [Darmowy]
pt_pt: [Gratuito]
ru: [Бесплатная]
uk: [Безкоштовна]

source: Bright
fa: درخشان
fr: Lumineux
id: Ceria
it: Luminoso
pl: Jasny
pt_pt: Clara
ru: Яркий
tr: Parlak
uk: Яскравий

source: Upbeat
fa: خوشبین
fr: Enjoué
id: Bersemangat
it: Allegro
pl: Energiczny
pt_pt: Otimista
ru: Энергичный
tr: Neşeli
uk: Бадьорий

source: Informative
fa: آموزنده
fr: Informatif
id: Informatif
it: Informativo
pl: Informacyjny
pt_pt: Informativa
ru: Информативный
tr: Bilgilendirici
uk: Інформативний

source: Firm
fa: متین
fr: Ferme
id: Tegas
it: fermo
pl: Stanowczy
pt_pt: Firme
ru: Твёрдый
tr: Şirket
uk: Рішучий
