Repository: muhammadGagah/VisionAssistantPro
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fa, fr, id, it, pl, pt_pt, ru, tr, uk

source: Advanced Model Routing (Task-specific)
fr: Guide de modèle avancé (spécifique à une tâche)
id: Perutean Model Lanjutan (Khusus Tugas)

source: OCR / Vision Model:
fr: Modèle OCR/Vision :
id: Model OCR / Visi:

source: Speech-to-Text (STT) Model:
fr: Modèle parole-vers-texte (transcription audio) :
id: Model Speech-to-Text (STT):

source: Text-to-Speech (TTS) Model:
fr: Modèle Texte-vers-Parole (synthèse vocale) :
id: Model Text-to-Speech (TTS):

source: Proxy URL:
fa: نشانیِ پراکسی:
fr: URL du proxy :
id: Alamat Proksi:
it: URL proxy:
pl: Adres URl servera proxy:
pt_pt: URL do Proxy:
ru: URL прокси:
tr: Proxy Adresi:
uk: URL проксі:

source: Check for updates on startup
fa: بررسیِ بروزرسانی در آغاز
fr: Vérifier les mises à jour au démarrage
id: Periksa pembaruan saat NVDA dinyalakan
it: Cerca aggiornamenti all'avvio
pl: Sprawdzaj aktualizacje przy uruchomieniu
pt_pt: Verificar actualizações no arranque
ru: Проверять обновления при запуске
tr: Başlangıçta güncellemeleri denetle
uk: Перевіряти наявність оновлень під час запуску

source: Clean Markdown in Chat
fa: پاک کردنِ Markdown در گفتگو
fr: Nettoyer le Markdown dans la discussion
id: Bersihkan markdown dalam obrolan
it: Pulisci Markdown in Chat
pl: Czyść Markdown w czacie
pt_pt: Markdown limpo na conversa
ru: Очищать Markdown в чате
tr: Sohbette Markdown'ı temizle
uk: Очистити Markdown у чаті

source: Copy AI responses to clipboard
fa: کپی کردنِ پاسخ‌های هوشِ مصنوعی در کلیپ‌بورد
fr: Copier les réponses de l'IA dans le presse-papiers
id: Salin tanggapan AI ke papan klip
it: Copia le risposte dell'IA negli appunti
pl: Kopiuj odpowiedzi AI do schowka
pt_pt: Copiar respostas da IA para a área de transferência
ru: Копировать ответы ИИ в буфер обмена
tr: YZ yanıtlarını panoya kopyala
uk: Копіювати відповіді ШІ в буфер обміну

source: Direct Output (No Chat Window)
fa: خروجیِ مستقیم (بدونِ پنجره‌ی گفتگو)
fr: Sortie directe (pas de fenêtre de discussion)
id: Output Langsung (Tanpa Jendela Obrolan)
it: Output diretto (senza finestra di chat)
pl: Tryb bezpośredni (nie pokazuje okna czatu)
pt_pt: Saída directa (sem janela de conversação)
ru: Прямой вывод (без окна чата)
tr: Doğrudan Çıktı (Sohbet Penceresi Yok)
uk: Прямий вивід (без вікна чату)

source: AI Behavior
fr: Comportement de l'IA
id: Perilaku AI

source: Creativity (Temperature, does not affect OCR/Translation):
fr: Créativité (température, n'affecte pas OCR / traduction) :
id: Kreativitas (Suhu, tidak memengaruhi OCR/Terjemahan):

source: Translation Languages
fa: زبان‌های ترجمه
fr: Langues de traduction
id: Bahasa Terjemahan
it: Lingue di traduzione
pl: Języki tłumaczenia
pt_pt: Idiomas da Tradução
ru: Языки перевода
tr: Çeviri Dilleri
uk: Мови перекладу

source: Source:
fa: مبدأ:
id: Bahasa sumber:
it: Sorgente:
pl: Źródłowy:
pt_pt: Origem:
ru: Исходный язык:
tr: Kaynak:
uk: Початкова мова:

source: Target:
fa: مقصد:
fr: Destination :
id: Bahasa tujuan:
it: Destinazione:
pl: Docelowy:
pt_pt: Destino:
ru: Целевой язык:
tr: Hedef:
uk: Мова для перекладу:

source: Smart Swap
fa: جابجاییِ هوشمند
fr: Permutation intelligente
id: Tukar bahasa secara cerdas
it: Scambio automatico
pl: Inteligentna zamiana
pt_pt: Substituição inteligente
ru: Умная замена
tr: Akıllı Takas
uk: Автоматична зміна мови

source: Document Reader
fa: سندخوان
fr: Lecteur de documents
id: Pembaca Dokumen
it: Lettore di documenti
pl: Czytnik dokumentów
pt_pt: Leitor de documentos
ru: Средство чтения документов
tr: Belge Okuyucu
uk: Читач документів

source: OCR Engine:
fa: موتورِ نویسه‌خوانِ نوری:
fr: Moteur d'OCR :
id: Mesin OCR:
it: Motore OCR:
pl: Silnik OCR:
pt_pt: Motor de OCR:
ru: Движок OCR:
tr: OCR Motoru:
uk: Механізм оптичного розпізнавання символів:

source: TTS Voice:
fa: صدای متن به گفتار:
fr: Voix de la synthèse vocale :
id: Suara TTS:
it: Voce TTS:
pl: Głos TTS:
pt_pt: Voz TTS:
ru: Голос TTS:
tr: TTS Sesi:
uk: Голос TTS:

source: Capture Method:
fa: روشِ کپچا:
fr: Méthode de récupération :
id: Metode Pengambilan:
it: Metodo di cattura:
pl: Metoda przechwytywania:
pt_pt: Método de Captura:
ru: Метод захвата:
tr: Yakalama Yöntemi:
uk: Метод захоплення:

source: Navigator Object
fa: پیمایشگر
fr: Objet navigateur
id: Objek Navigator
it: Oggetto del navigatore
pl: Obiekt nawigatora
pt_pt: Objeto do Navegador
ru: Объект навигатора
tr: Dolaşım Nesnesi
uk: Об'єкт навігатора

source: Full Screen
fa: تمام‌صفحه
fr: Tout l'écran
id: Seluruh layar
it: Schermo intero
pl: Cały ekran
pt_pt: Ecrã inteiro
ru: Весь экран
tr: Tam ekran
uk: Весь екран

source: Prompts
fa: پرامپت‌ها
id: Perintah
pl: Polecenia
ru: Запросы
tr: İstemler
uk: Підказки

source: Manage default and custom prompts.
fa: مدیریتِ پرامپت‌های پیش‌فرض و سفارشی.
fr: Gérer les prompts par défaut et personnalisées.
id: Kelola perintah default dan kustom.
pl: Zarządzaj domyślnymi i niestandardowymi poleceniami.
pt_pt: Gerencie prompts padrão e personalizados.
ru: Управление запросами по умолчанию и пользовательскими запросами
tr: Varsayılan ve özel istemleri yönetin.
uk: Керувати початковими та користувацькими підказками.

source: Manage Prompts...
fa: مدیریتِ پرامپت‌ها...
fr: Gérer les prompts...
id: Kelola Perintah...
pl: Zarządzaj poleceniami...
pt_pt: Gerir Prompts...
ru: Управлять запросами...
tr: İstemleri Yönet...
uk: Керувати підказками...

source: Default prompts: {defaultCount}, Custom prompts: {customCount}
fa: پرامپت‌های پیش‌فرض: {defaultCount}، پرامپت‌های سفارشی: {customCount}
fr: Prompts par défaut : {defaultCount}, Prompts personnalisés : {customCount}
id: Perintah bawaan: {defaultCount}, Perintah khusus: {customCount}
pl: Polecenia domyślne: {defaultCount}, niestandardowe: {customCount}
pt_pt: Prompts predefinidos: {defaultCount}, Prompts personalizados: {customCount}
ru: Запросы по умолчанию: {defaultCount}, Пользовательские запросы: {customCount}
tr: Varsayılan istem: {defaultCount}, Özel istem: {customCount}
uk: Початкових підказок: {defaultCount}, Користувацьких підказок: {customCount}

source: Fetching models...
fr: Récupération des modèles...
id: Mengambil model...

source: Default (Auto)
fr: Défaut (Automatique)
id: Bawaan (Otomatis)

source: Models updated
fr: Modèles mis à jour
id: Model diperbarui

source: Failed to fetch models
fr: Échec de la récupération des modèles
id: Gagal mengambil model

source: Options
fa: گزینه‌ها
id: Pilihan
it: Opzioni
pl: Opcje
pt_pt: Opções
ru: Параметры
tr: Seçenekler
uk: Налаштування

source: Total Pages (All Files): {count}
fa: تمامِ صفحه‌ها (همه‌ی فایل‌ها): {count}
fr: Nombre total de pages (tous les fichiers): {count}
id: Total Halaman (Semua File): {count}
it: Totale delle pagine (tutti i files): {count}
pl: Łączna liczba stron (wszystkie pliki): {count}
pt_pt: Total de páginas (todos os ficheiros): {count}
ru: Всего страниц (все файлы): {count}
tr: Toplam Sayfa (Tüm Dosyalar): {count}
uk: Загальна кількість сторінок (усі файли): {count}

source: Range
fa: محدوده
fr: Intervalle
id: Jangkauan
it: Intervallo
pl: Zakres
pt_pt: Intervalo
ru: Диапазон
tr: Aralık
uk: Діапазон

source: From:
fa: از:
fr: De :
id: Dari:
it: Da:
pl: Od:
pt_pt: De:
ru: От:
tr: Kaynak:
uk: Від:

source: To:
fa: تا:
fr: À :
id: Ke:
it: A:
pl: Do:
pt_pt: Para:
ru: До:
tr: İle:
uk: До:

source: Translate Output
fa: خروجیِ ترجمه
fr: Traduire la sortie
id: Terjemahkan Output
it: Traduci l'output
pl: Przetłumacz wynik
pt_pt: Traduzir saída
ru: Переводить вывод
tr: Çeviri Çıktısı
uk: Перекласти вихідні дані

source: Start
fa: شروع
fr: Commencer
id: Mulai
it: Inizia
pl: Rozpocznij
pt_pt: Iniciar
ru: Начать
tr: Başlat
uk: Почати

source: Cancel
fa: لغو
fr: Annuler
id: Batalkan
it: Annulla
pl: Anuluj
pt_pt: Cancelar
ru: Отмена
tr: İptal
uk: Скасувати

source: Ask about Document
fa: پرسش درباره‌ی سند
fr: Poser des questions sur un document
id: Tanyakan tentang Dokumen
it: Fai domande sul documento
pl: Zapytaj o dokument
pt_pt: Perguntar sobre o documento
ru: Задать вопрос о документе
tr: Belge hakkında soru sor
uk: Запитати про документ

source: File: {name}
fa: فایل: {name}
fr: Fichier : {name}
id: Berkas: {name}
pl: Plik: {name}
pt_pt: Ficheiro: {name}
ru: Файл: {name}
tr: Dosya: {name}
uk: Файл: {name}

source: Uploading to AI...
fr: Téléversement vers l'IA en cours...
id: Mengunggah ke AI...

source: Your Question:
fa: سؤالِ شما:
fr: Votre question :
id: Masukkan Pertanyaan Anda:
it: La tua domanda:
pl: Twoje pytanie:
pt_pt: A sua pergunta:
ru: Ваш вопрос:
tr: Sorunuz:
uk: Ваше запитання:

source: Ready! Ask your questions.
fa: آماده شد! سؤال‌هایتان را بپرسید.
fr: Prêt ! Posez votre question.
id: Siap! Ajukan pertanyaan Anda.
it: Documento pronto. Fai la tua domanda.
pl: Gotowe! Zadawaj pytania.
pt_pt: Pronto! Faça as suas perguntas.
ru: Готово! Задавайте вопросы.
tr: Hazır! Sorularınızı sorun.
uk: Готовий! Ставте свої запитання.

source: Idle
fa: بیکار
fr: Inactif
id: Tidak digunakan
it: Inattivo
pl: Bezczynny
pt_pt: Inactivo
ru: Бездействие
tr: Boşta
uk: Бездіяльність

source: Initializing...
fa: در حالِ راه‌اندازی...
fr: Initialisation en cours...
id: Menginisialisasi...
it: Inizializzazione...
pl: Inicjowanie...
pt_pt: A iniciar…
ru: Инициализация...
tr: Başlatılıyor...
uk: Ініціалізація...

source: Previous (Ctrl+PageUp)
fa: قبلی (Ctrl+PageUp)
fr: Précédente (Ctrl+PagePréc)
id: Sebelumnya (Ctrl+PageUp)
it: Precedente (Ctrl+PaginaSu)
pl: Poprzednia (Ctrl+PageUp)
pt_pt: Anterior (Ctrl+PageUp)
ru: Предыдущая (Ctrl+PageUp)
tr: Önceki (Ctrl+Sayfa Yukarı)
uk: Попередня (Ctrl+PageUp)

source: Next (Ctrl+PageDown)
fa: بعدی (Ctrl+PageDown)
fr: Suivante (Ctrl+PageSuivante)
id: Berikutnya (Ctrl+PageDown)
it: Successivo (Ctrl+PaginaGiù)
pl: Następna (Ctrl+PageDown)
pt_pt: Próximo (Ctrl+PageDown)
ru: Следующая (Ctrl+PageDown)
tr: Sonraki (Ctrl+Sayfa Aşağı)
uk: Наступна (Ctrl+PageDown)

source: Go to:
fa: برو به:
fr: Allez à :
id: Menuju ke:
it: Vai a:
pl: Przejdź do:
pt_pt: Ir para:
ru: Перейти на:
tr: Şuraya git:
uk: Перейти до:

source: Ask AI (Alt+A)
fa: از هوشِ مصنوعی بپرس (Alt+A)
fr: Demandez à l'IA (Alt+A)
id: Tanya AI (Alt+A)
it: Chiedi all'AI (Alt+A)
pl: Zapytaj AI (Alt+A)
pt_pt: Pergunte à IA (Alt+A)
ru: Спросить ИИ (Alt+A)
tr: Yapay zekaya sor (Alt+A)
uk: Запитати ШІ (Alt+A)

source: Re-scan with AI (Alt+R)
fr: Re-scanner avec l'IA (Alt+R)
id: Pindai ulang dengan AI (Alt+R)

source: Generate Audio (Alt+G)
fa: تولیدِ صوت
fr: Générer de l'audio (Alt+G)
id: Hasilkan Audio (Alt+G)
it: Genera Audio (Alt+G)
pl: Generuj audio (Alt+G)
pt_pt: Gerar áudio (Alt+G)
ru: Создать аудио (Alt+G)
tr: Ses Oluştur (Alt+G)
uk: Створити аудіо (Alt+G)

source: Save (Alt+S)
fa: ذخیره کردن (Alt+S)
fr: Enregistrer (Alt+S)
id: Simpan (Alt+S)
it: Salva (Alt+S)
pl: Zapisz (Alt+S)
pt_pt: Guardar (Alt+S)
ru: Сохранить (Alt+S)
tr: Kaydet (Alt+S)
uk: Зберегти (Alt+S)

source: Page {num} ready
fa: صفحه‌ی {num} آماده شد
fr: Page {num} prête
id: Halaman {num} telah siap
it: Pagina {num} pronta
pl: Strona {num} gotowa
pt_pt: Página {num} pronta
ru: Страница {num} готова
tr: {num} Sayfa hazır
uk: Сторінка {num} готова

source: [OCR failed. Try a different AI model or provider.]
fr: [Échec de l'OCR. Essayez un autre modèle ou fournisseur d'IA.]
id: [OCR gagal. Coba model atau penyedia AI lain.]

source: Error processing page.
fa: خطا هنگامِ پردازشِ صفحه.
fr: Erreur lors du traitement de la page.
id: Kesalahan pemrosesan halaman.
it: Errore nel processare la pagina.
pl: Błąd przetwarzania strony.
pt_pt: Erro ao processar a página.
ru: Ошибка обработки страницы.
tr: Sayfa işlenirken hata oluştu.
uk: Помилка обробки сторінки.

source: Page {current} of {total}
fa: صفحه‌ی {current} از {total}
fr: Page {current} sur {total}
id: Halaman {current} dari {total}
it: Pagina {current} di {total}
pl: Strona {current} z {total}
pt_pt: Página {current} de {total}
ru: Страница {current} из {total}
tr: {current} bölü {total} Sayfa
uk: Сторінка {current} із {total}

source: Processing in background...
fa: در حالِ پردازش در پس‌زمینه...
fr: Traitement en arrière-plan...
id: Memproses di latar belakang...
it: Elaborazione in background...
pl: Przetwarzanie w tle...
pt_pt: A processar em segundo plano…
ru: Обработка в фоне...
tr: Arka planda işleniyor...
uk: Обробка у фоновому режимі...

source: Page {num}
fa: صفحه‌ی {num}
id: Halaman {num}
it: Pagina {num}
pl: Strona {num}
pt_pt: Página {num}
ru: Страница {num}
tr: {num} Sayfa
uk: Сторінка {num}

source: Formatted Content
fa: محتوای قالب‌بندی‌شده
fr: Conversation mise en forme
id: Konten Terformat
it: Contenuto formattato
pl: Sformatowana treść
pt_pt: Conteúdo formatado
ru: Форматированное содержимое
tr: Biçimlendirilmiş İçerik
uk: Відформатований вміст

source: Error
fa: خطا
fr: Erreur
id: Kesalahan
it: Errore
pl: Błąd
pt_pt: Erro
ru: Ошибка
tr: Hata
uk: Помилка

source: Current Page
fa: صفحه‌ی جاری
fr: Page actuelle
id: Halaman Saat Ini
it: Pagina corrente
pl: Bieżąca strona
pt_pt: Página actual
ru: Текущая страница
tr: Geçerli Sayfa
uk: Поточна сторінка

source: All Pages (In Range)
fa: همه‌ی صفحات (در محدوده)
fr: Toutes les pages (dans l'intervalle)
id: Semua Halaman (Dalam Jangkauan)
it: Tutte le pagine (nell'intervallo)
pl: Wszystkie strony (w zakresie)
pt_pt: Todas as páginas (no intervalo especificado)
ru: Все страницы (в диапазоне)
tr: Tüm Sayfalar (Aralık İçinde)
uk: Усі сторінки (в діапазоні)

source: Scanning with AI...
fr: Numérisation avec l'AI...
id: Memindai dengan AI...

source: [Scan failed: {err}]
fr: Échec de la numérisation : {err}
id: [Pemindayan gagal: {err}]

source: [No text detected]
fr: [Aucun texte détecté]
id: [Tidak ada teks yang terdeteksi]

source: Scan complete
fa: اسکن کامل شد
fr: Scan terminé
id: Pemindaian selesai
it: Scansione completa
pl: Skanowanie zakończone
pt_pt: Digitalização concluída
ru: Сканирование завершено
tr: Tarama tamamlandı
uk: Сканування завершено

source: [Error: {msg}]
fr: Erreur : {msg}
id: [Kesalahan: {msg}]

source: Batch Processing Started
fa: پردازشِ دسته‌ای آغاز شد
fr: Traitement par lots démarré
id: Pemrosesan Batch Dimulai
it: Elaborazione Batch avviata
pl: Rozpoczęto przetwarzanie wsadowe
pt_pt: Processamento em lote iniciado
ru: Пакетная обработка начата
tr: Toplu İşleme Başladı
uk: Розпочато пакетну обробку

source: Error creating temporary PDF.
fa: خطا در ایجادِ PDFِ موقتی.
fr: Erreur lors de la création du PDF temporaire.
id: Terjadi kesalahan saat membuat PDF sementara.
it: Errore nella creazione del PDF temporaneo.
pl: Błąd tworzenia tymczasowego pliku PDF.
pt_pt: Erro ao criar o PDF temporário.
ru: Ошибка создания временного PDF.
tr: Geçici PDF oluşturulurken hata oluştu.
uk: Помилка створення тимчасового PDF.

source: Batch Scan Complete
fa: اسکنِ دسته‌ای کامل شد
fr: Scan par lots terminée
id: Pemindaian Batch Selesai
it: Scansione batch completa
pl: Skanowanie wsadowe zakończone
pt_pt: Digitalização em lote concluída
ru: Пакетное сканирование завершено
tr: Toplu Tarama Tamamlandı
uk: Пакетне сканування завершено

source: Scan Complete
fr: Scan terminé
id: Pemindaian Selesai

source: Batch Scan Failed
fr: Échec du scan par lots
id: Gagal Memindai Batch

source: AI is scanning {n} pages in background.
fr: L'IA analyse {n} pages en arrière-plan.
id: AI sedang memindai {n} halaman di latar belakang.

source: TTS is not supported by the current provider or configuration.
fr: La synthèse vocale n'est pas prise en charge par le fournisseur ou la configuration actuelle.
id: TTS tidak didukung oleh penyedia atau konfigurasi saat ini.

source: Generate for Current Page
fa: تولید برای صفحه‌ی جاری
fr: Générer pour la page actuelle
id: Hasilkan untuk Halaman Saat Ini
it: Generare per la pagina corrente
pl: Generuj dla bieżącej strony
pt_pt: Gerar para a página actual
ru: Создать для текущей страницы
tr: Geçerli Sayfa için Oluştur
uk: Створити для поточної сторінки

source: Generate for All Pages (In Range)
fa: تولید برای همه‌ی صفحات (در محدوده)
fr: Générer pour toutes les pages (dans l'intervalle)
id: Hasilkan untuk Semua Halaman (Dalam Jangkauan)
it: Generare per tutte le pagine (nell'intervallo)
pl: Generuj dla wszystkich stron (w zakresie)
pt_pt: Gerar para todas as páginas (no intervalo)
ru: Создать для всех страниц (в диапазоне)
tr: Tüm Sayfalar için Oluştur (Aralık İçinde)
uk: Створити для всіх сторінок (у діапазоні)

source: No text to read.
fa: متنی برای خواندن وجود ندارد.
fr: Aucun texte à lire.
id: Tidak ada teks untuk dibaca.
it: Nessun testo da leggere.
pl: Brak tekstu do odczytu.
pt_pt: Nenhum texto para ler.
ru: Нет текста для чтения.
tr: Okunacak metin yok.
uk: Немає тексту для читання.

source: Gathering text for audio...
fa: جمع‌آوریِ متن برای صوت...
fr: Récupération du texte pour l'audio...
id: Menyiapkan teks untuk audio...
it: Raccolta del testo per l'audio...
pl: Zbieranie tekstu do audio...
pt_pt: A recolher texto para áudio…
ru: Сбор текста для аудио...
tr: Ses için metin toplanıyor...
uk: Збір тексту для аудіо...

source: Save Audio
fa: ذخیره‌ی صوت
fr: Enregistrer en tant qu'audio
id: Simpan Audio
it: Salva audio
pl: Zapisz audio
pt_pt: Guardar áudio
ru: Сохранить аудио
tr: Sesi Kaydet
uk: Зберегти аудіо

source: Generating Audio...
fa: در حالِ تولیدِ صوت...
fr: Génération de l'audio...
id: Menghasilkan Audio...
it: Generazione audio...
pl: Generowanie audio...
pt_pt: A gerar áudio…
ru: Создание аудио...
tr: Ses Oluşturuluyor...
uk: Створення аудіо...

source: Unknown Error
fr: Erreur inconnue
id: Kesalahan Tidak Diketahui

source: lame.exe not found in lib folder.
fa: lame.exe در پوشه‌ی lib پیدا نشد.
fr: lame.exe introuvable dans le dossier lib.
id: lame.exe tidak ditemukan di folder lib.
it: lame.exe non trovata in lib folder.
pl: Nie znaleziono lame.exe w folderze lib.
pt_pt: lame.exe não encontrado na pasta lib.
ru: lame.exe не найден в папке lib.
tr: lame.exe lib klasöründe bulunamadı.
uk: lame.exe не знайдено в папці lib.

source: Audio Saved
fa: صوت ذخیره شد
fr: Audio enregistré
id: Audio Disimpan
it: Audio salvato
pl: Audio zapisane
pt_pt: Áudio guardado
ru: Аудио сохранено
tr: Ses Kaydedildi
uk: Аудіо збережено

source: Audio file generated and saved successfully.
fa: فایلِ صوتی با موفقیت تولید و ذخیره شد.
fr: Fichier audio généré et enregistré avec succès.
id: File audio berhasil dibuat dan disimpan.
it: File audio generato e salvato.
pl: Plik audio został wygenerowany i zapisany.
pt_pt: Ficheiro de áudio gerado e guardado com sucesso.
ru: Аудиофайл успешно создан и сохранён.
tr: Ses dosyası başarıyla oluşturuldu ve kaydedildi.
uk: Аудіофайл створено та успішно збережено.

source: Please configure Gemini API Key.
fa: لطفا کلیدِ APIِ جمینای را پیکربندی کنید.
fr: Veuillez configurer la clé API de Gemini.
id: Silakan konfigurasikan Kunci API Gemini.
it: Per favore, configura la chiave api.
pl: Skonfiguruj klucz API Gemini.
pt_pt: Por favor, configure a chave da API do Gemini.
ru: Настройте ключ API Gemini.
tr: Lütfen Gemini API Anahtarını yapılandırın.
uk: Будь ласка, налаштуйте ключ API Gemini.

source: Save
fa: ذخیره
fr: Enregistrer
id: Simpan
it: Salva
pl: Zapisz
pt_pt: Guardar
ru: Сохранить
tr: Kaydet
uk: Зберегти

source: Saving Page {num}...
fa: در حالِ ذخیره‌ی صفحه‌ی {num}...
fr: Enregistrement de la page {num}...
id: Sedang menyimpan {num}...
it: Salvataggio della pagina {num}...
pl: Zapisywanie strony {num}...
pt_pt: A guardar a página {num}…
ru: Сохранение страницы {num}...
tr: {num} Sayfa kaydediliyor...
uk: Збереження сторінки {num}...

source: Saved
fa: ذخیره شد
fr: Enregistré
id: Disimpan
it: Salvato
pl: Zapisano
pt_pt: Guardado
ru: Сохранено
tr: Kaydedildi
uk: Збережено

source: File saved successfully.
fa: فایل با موفقیت ذخیره شد.
fr: Fichier enregistré avec succès.
id: File berhasil disimpan.
it: File salvato con successo.
pl: Plik został zapisany.
pt_pt: Ficheiro guardado com sucesso.
ru: Файл успешно сохранён.
tr: Dosya başarıyla kaydedildi.
uk: Файл успішно збережено.

source: &Document Reader...
fa: &سندخوان...
fr: Lecteur de &document...
id: &Pembaca Dokumen...
it: &Lettore documenti...
pl: &Czytnik dokumentów...
pt_pt: &Leitor de documentos...
ru: Средство &чтения документов...
tr: &Belge Okuyucu...
uk: &Читач документів...

source: Transcribe &Audio File...
fa: رونویسیِ فایلِ &صوتی...
fr: Transcrire un fichier &audio...
id: Transkripsikan File &Audio...
it: &Trascrive file audio...
pl: Transkrybuj plik &audio...
pt_pt: Transcrever ficheiro de &áudio…
ru: Расшифровать &аудиофайл...
tr: Ses Dosy&asını Metne Dönüştür...
uk: Транскрибувати &аудіофайл...

source: Analyze &Video URL...
fa: تحلیلِ آدرسِ ویدیو...
fr: Analyser une &vidéo...
id: Analisis &URL Video...
it: Analisi URL &video...
pl: Analizuj adres URL &wideo...
pt_pt: Analisar URL de &vídeo...
ru: Проанализировать &URL видео...
tr: &Video Bağlantısını analiz et...
uk: Аналіз &URL-адреси відео...

source: &Settings...
fa: &تنظیمات...
fr: &Paramètres...
id: &Pengaturan...
it: &Impostazioni...
pl: &Ustawienia...
pt_pt: &Configurações...
ru: &Настройки...
tr: &Ayarlar...
uk: &Налаштування...

source: Check for &Update
fa: بررسی برای &بروزرسانی
fr: Vérification des mises à jo&ur
id: Periksa &Pembaruan
it: &Controlla aggiornamenti
pl: Sprawdź &aktualizację
pt_pt: Verificar &atualizações
ru: Проверить &обновления
tr: &Güncellemeleri Denetle
uk: Перевірити &оновлення

source: Docu&mentation
fa: &راهنما
id: &Dokumentasi
it: &Documentazione
pl: Doku&mentacja
pt_pt: Docu&mentação
ru: &Документация
tr: &Yardım
uk: &Документація

source: D&onate
fa: &کمکِ مالی
fr: Faire un d&on
id: &Donasi
it: &Fai una donazione
pl: W&esprzyj
pt_pt: D&oar
ru: Под&держать
tr: Bağış ya&p
uk: &Пожертвувати

source: Telegram &Channel
fa: کانالِ &تلگرام
fr: &Canal Telegram
id: Saluran &Telegram
pl: Kanał w &Telegramie
pt_pt: &Canal no Telegram
tr: Telegram &Kanalı
uk: Канал &Telegram

source: Open
fa: باز کردن
fr: Ouvrir
id: Buka
it: Apri
pl: Otwórz
pt_pt: Abrir
ru: Открыть
tr: Aç
uk: Відкрити

source: Supported Files
fa: فایل‌های پشتیبانی‌شده
fr: Fichiers pris en charge
id: File yang Didukung
it: Files supportati
pl: Obsługiwane pliki
pt_pt: Ficheiros suportados
ru: Поддерживаемые файлы
tr: Desteklenen Dosyalar
uk: Підтримувані файли

source: PyMuPDF library is missing.
fa: کتابخانه‌ی PyMuPDF موجود نیست.
fr: La bibliothèque PyMuPDF est manquante.
id: Pustaka PyMuPDF tidak ada.
it: La libreria PyMuPDF è mancante.
pl: Brak biblioteki PyMuPDF.
pt_pt: A biblioteca PyMuPDF está ausente.
ru: Библиотека PyMuPDF отсутствует.
tr: PyMuPDF kütüphanesi eksik.
uk: Бібліотека PyMuPDF відсутня.

source: No readable pages found.
fa: هیچ صفحه‌ی قابلِ خواندنی یافت نشد.
fr: Aucune page lisible trouvée.
id: Tidak ditemukan halaman yang dapat dibaca.
it: Nessuna pagina leggibile trovata.
pl: Nie znaleziono stron do odczytu.
pt_pt: Nenhuma página legível encontrada.
ru: Читаемые страницы не найдены.
tr: Okunabilir sayfa bulunamadı.
uk: Читабельних сторінок не знайдено.

source: Activates the Command Layer for quick access to all features.
fa: لایه‌ی فرمان‌ها را برای دسترسیِ سریع به همه‌ی ویژگی‌ها فعال می‌کند.
fr: Active les commandes séquentielles pour un accès rapide à toutes les fonctionnalités.
id: Mengaktifkan Lapisan Perintah untuk akses cepat ke semua fitur.
it: Attiva il layer di comandi per un accesso rapido a tutte le funzionalità.
pl: Aktywuje warstwę poleceń umożliwiającą szybki dostęp do wszystkich funkcji.
pt_pt: Ativa a Camada de Comandos para acesso rápido a todos os recursos.
ru: Активирует командный слой для быстрого доступа ко всем функциям.
tr: Tüm özelliklere hızlı erişim için Komut Katmanını etkinleştirir.
uk: Активує командний шар для швидкого доступу до всіх функцій.
